SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pctb_template/common/hc32f460pctb.h
typedef struct
{
    __IO uint32_t MINU                      : 4;
    __IO uint32_t MIND                      : 3;
    uint32_t RESERVED7                      :25;
} stc_rtc_min_field_t;

typedef struct
{
    __IO uint32_t HOURU                     : 4;
    __IO uint32_t HOURD                     : 2;
    uint32_t RESERVED6                      :26;
} stc_rtc_hour_field_t;

typedef struct
{
    __IO uint32_t WEEK                      : 3;
    uint32_t RESERVED3                      :29;
} stc_rtc_week_field_t;

typedef struct
{
    __IO uint32_t DAYU                      : 4;
    __IO uint32_t DAYD                      : 2;
    uint32_t RESERVED6                      :26;
} stc_rtc_day_field_t;

typedef struct
{
    __IO uint32_t MON                       : 5;
    uint32_t RESERVED5                      :27;
} stc_rtc_mon_field_t;

typedef struct
{
    __IO uint32_t YEARU                     : 4;
    __IO uint32_t YEARD                     : 4;
    uint32_t RESERVED8                      :24;
} stc_rtc_year_field_t;

typedef struct
{
    __IO uint32_t ALMMINU                   : 4;
    __IO uint32_t ALMMIND                   : 3;
    uint32_t RESERVED7                      :25;
} stc_rtc_almmin_field_t;

typedef struct
{
    __IO uint32_t ALMHOURU                  : 4;
    __IO uint32_t ALMHOURD                  : 2;
    uint32_t RESERVED6                      :26;
} stc_rtc_almhour_field_t;

typedef struct
{
    __IO uint32_t ALMWEEK                   : 7;
    uint32_t RESERVED7                      :25;
} stc_rtc_almweek_field_t;

typedef struct
{
    __IO uint32_t COMP8                     : 1;
    uint32_t RESERVED1                      : 6;
    __IO uint32_t COMPEN                    : 1;
    uint32_t RESERVED8                      :24;
} stc_rtc_errcrh_field_t;

typedef struct
{
    __IO uint32_t COMP                      : 8;
    uint32_t RESERVED8                      :24;
} stc_rtc_errcrl_field_t;

typedef struct
{
    __IO uint16_t TBS                       :12;
    uint16_t RESERVED12                     : 4;
} stc_sdioc_blksize_field_t;

typedef struct
{
    uint16_t RESERVED0                      : 1;
    __IO uint16_t BCE                       : 1;
    __IO uint16_t ATCEN                     : 2;
    __IO uint16_t DDIR                      : 1;
    __IO uint16_t MULB                      : 1;
    uint16_t RESERVED6                      :10;
} stc_sdioc_transmode_field_t;

typedef struct
{
    __IO uint16_t RESTYP                    : 2;
    uint16_t RESERVED2                      : 1;
    __IO uint16_t CCE                       : 1;
    __IO uint16_t ICE                       : 1;
    __IO uint16_t DAT                       : 1;
    __IO uint16_t TYP                       : 2;
    __IO uint16_t IDX                       : 6;
    uint16_t RESERVED14                     : 2;
} stc_sdioc_cmd_field_t;

typedef struct
{
    __IO uint32_t CIC                       : 1;
    __IO uint32_t CID                       : 1;
    __IO uint32_t DA                        : 1;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t WTA                       : 1;
    __IO uint32_t RTA                       : 1;
    __IO uint32_t BWE                       : 1;
    __IO uint32_t BRE                       : 1;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t CIN                       : 1;
    __IO uint32_t CSS                       : 1;
    __IO uint32_t CDL                       : 1;
    __IO uint32_t WPL                       : 1;
    __IO uint32_t DATL                      : 4;
    __IO uint32_t CMDL                      : 1;
    uint32_t RESERVED25                     : 7;
} stc_sdioc_pstat_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 1;
    __IO uint8_t DW                         : 1;
    __IO uint8_t HSEN                       : 1;
    uint8_t RESERVED3                       : 2;
    __IO uint8_t EXDW                       : 1;
    __IO uint8_t CDTL                       : 1;
    __IO uint8_t CDSS                       : 1;
} stc_sdioc_hostcon_field_t;

typedef struct
{
    __IO uint8_t PWON                       : 1;
    uint8_t RESERVED1                       : 7;
} stc_sdioc_pwrcon_field_t;

typedef struct
{
    __IO uint8_t SABGR                      : 1;
    __IO uint8_t CR                         : 1;
    __IO uint8_t RWC                        : 1;
    __IO uint8_t IABG                       : 1;
    uint8_t RESERVED4                       : 4;
} stc_sdioc_blkgpcon_field_t;

typedef struct
{
    __IO uint16_t ICE                       : 1;
    uint16_t RESERVED1                      : 1;
    __IO uint16_t CE                        : 1;
    uint16_t RESERVED3                      : 5;
    __IO uint16_t FS                        : 8;
} stc_sdioc_clkcon_field_t;

typedef struct
{
    __IO uint8_t DTO                        : 4;
    uint8_t RESERVED4                       : 4;
} stc_sdioc_toutcon_field_t;

typedef struct
{
    __IO uint8_t RSTA                       : 1;
    __IO uint8_t RSTC                       : 1;
    __IO uint8_t RSTD                       : 1;
    uint8_t RESERVED3                       : 5;
} stc_sdioc_sftrst_field_t;

typedef struct
{
    __IO uint16_t CC                        : 1;
    __IO uint16_t TC                        : 1;
    __IO uint16_t BGE                       : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t BWR                       : 1;
    __IO uint16_t BRR                       : 1;
    __IO uint16_t CIST                      : 1;
    __IO uint16_t CRM                       : 1;
    __IO uint16_t CINT                      : 1;
    uint16_t RESERVED9                      : 6;
    __IO uint16_t EI                        : 1;
} stc_sdioc_norintst_field_t;

typedef struct
{
    __IO uint16_t CTOE                      : 1;
    __IO uint16_t CCE                       : 1;
    __IO uint16_t CEBE                      : 1;
    __IO uint16_t CIE                       : 1;
    __IO uint16_t DTOE                      : 1;
    __IO uint16_t DCE                       : 1;
    __IO uint16_t DEBE                      : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t ACE                       : 1;
    uint16_t RESERVED9                      : 7;
} stc_sdioc_errintst_field_t;

typedef struct
{
    __IO uint16_t CCEN                      : 1;
    __IO uint16_t TCEN                      : 1;
    __IO uint16_t BGEEN                     : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t BWREN                     : 1;
    __IO uint16_t BRREN                     : 1;
    __IO uint16_t CISTEN                    : 1;
    __IO uint16_t CRMEN                     : 1;
    __IO uint16_t CINTEN                    : 1;
    uint16_t RESERVED9                      : 7;
} stc_sdioc_norintsten_field_t;

typedef struct
{
    __IO uint16_t CTOEEN                    : 1;
    __IO uint16_t CCEEN                     : 1;
    __IO uint16_t CEBEEN                    : 1;
    __IO uint16_t CIEEN                     : 1;
    __IO uint16_t DTOEEN                    : 1;
    __IO uint16_t DCEEN                     : 1;
    __IO uint16_t DEBEEN                    : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t ACEEN                     : 1;
    uint16_t RESERVED9                      : 7;
} stc_sdioc_errintsten_field_t;

typedef struct
{
    __IO uint16_t CCSEN                     : 1;
    __IO uint16_t TCSEN                     : 1;
    __IO uint16_t BGESEN                    : 1;
    uint16_t RESERVED3                      : 1;
    __IO uint16_t BWRSEN                    : 1;
    __IO uint16_t BRRSEN                    : 1;
    __IO uint16_t CISTSEN                   : 1;
    __IO uint16_t CRMSEN                    : 1;
    __IO uint16_t CINTSEN                   : 1;
    uint16_t RESERVED9                      : 7;
} stc_sdioc_norintsgen_field_t;

typedef struct
{
    __IO uint16_t CTOESEN                   : 1;
    __IO uint16_t CCESEN                    : 1;
    __IO uint16_t CEBESEN                   : 1;
    __IO uint16_t CIESEN                    : 1;
    __IO uint16_t DTOESEN                   : 1;
    __IO uint16_t DCESEN                    : 1;
    __IO uint16_t DEBESEN                   : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t ACESEN                    : 1;
    uint16_t RESERVED9                      : 7;
} stc_sdioc_errintsgen_field_t;

typedef struct
{
    __IO uint16_t NE                        : 1;
    __IO uint16_t TOE                       : 1;
    __IO uint16_t CE                        : 1;
    __IO uint16_t EBE                       : 1;
    __IO uint16_t IE                        : 1;
    uint16_t RESERVED5                      : 2;
    __IO uint16_t CMDE                      : 1;
    uint16_t RESERVED8                      : 8;
} stc_sdioc_atcerrst_field_t;

typedef struct
{
    __IO uint16_t FNE                       : 1;
    __IO uint16_t FTOE                      : 1;
    __IO uint16_t FCE                       : 1;
    __IO uint16_t FEBE                      : 1;
    __IO uint16_t FIE                       : 1;
    uint16_t RESERVED5                      : 2;
    __IO uint16_t FCMDE                     : 1;
    uint16_t RESERVED8                      : 8;
} stc_sdioc_fea_field_t;

typedef struct
{
    __IO uint16_t FCTOE                     : 1;
    __IO uint16_t FCCE                      : 1;
    __IO uint16_t FCEBE                     : 1;
    __IO uint16_t FCIE                      : 1;
    __IO uint16_t FDTOE                     : 1;
    __IO uint16_t FDCE                      : 1;
    __IO uint16_t FDEBE                     : 1;
    uint16_t RESERVED7                      : 1;
    __IO uint16_t FACE                      : 1;
    uint16_t RESERVED9                      : 7;
} stc_sdioc_fee_field_t;

typedef struct
{
    __IO uint32_t SPIMDS                    : 1;
    __IO uint32_t TXMDS                     : 1;
    uint32_t RESERVED2                      : 1;
    __IO uint32_t MSTR                      : 1;
    __IO uint32_t SPLPBK                    : 1;
    __IO uint32_t SPLPBK2                   : 1;
    __IO uint32_t SPE                       : 1;
    __IO uint32_t CSUSPE                    : 1;
    __IO uint32_t EIE                       : 1;
    __IO uint32_t TXIE                      : 1;
    __IO uint32_t RXIE                      : 1;
    __IO uint32_t IDIE                      : 1;
    __IO uint32_t MODFE                     : 1;
    __IO uint32_t PATE                      : 1;
    __IO uint32_t PAOE                      : 1;
    __IO uint32_t PAE                       : 1;
    uint32_t RESERVED16                     :16;
} stc_spi_cr1_field_t;

typedef struct
{
    __IO uint32_t FTHLV                     : 2;
    uint32_t RESERVED2                      : 4;
    __IO uint32_t SPRDTD                    : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t SS0PV                     : 1;
    __IO uint32_t SS1PV                     : 1;
    __IO uint32_t SS2PV                     : 1;
    __IO uint32_t SS3PV                     : 1;
    uint32_t RESERVED12                     : 8;
    __IO uint32_t MSSI                      : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t MSSDL                     : 3;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t MIDI                      : 3;
    uint32_t RESERVED31                     : 1;
} stc_spi_cfg1_field_t;

typedef struct
{
    __IO uint32_t OVRERF                    : 1;
    __IO uint32_t IDLNF                     : 1;
    __IO uint32_t MODFERF                   : 1;
    __IO uint32_t PERF                      : 1;
    __IO uint32_t UDRERF                    : 1;
    __IO uint32_t TDEF                      : 1;
    uint32_t RESERVED6                      : 1;
    __IO uint32_t RDFF                      : 1;
    uint32_t RESERVED8                      :24;
} stc_spi_sr_field_t;

typedef struct
{
    __IO uint32_t CPHA                      : 1;
    __IO uint32_t CPOL                      : 1;
    __IO uint32_t MBR                       : 3;
    __IO uint32_t SSA                       : 3;
    __IO uint32_t DSIZE                     : 4;
    __IO uint32_t LSBF                      : 1;
    __IO uint32_t MIDIE                     : 1;
    __IO uint32_t MSSDLE                    : 1;
    __IO uint32_t MSSIE                     : 1;
    uint32_t RESERVED16                     :16;
} stc_spi_cfg2_field_t;

typedef struct
{
    __IO uint32_t SRAM12_RWT                : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t SRAM12_WWT                : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t SRAM3_RWT                 : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t SRAM3_WWT                 : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t SRAMH_RWT                 : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t SRAMH_WWT                 : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t SRAMR_RWT                 : 3;
    uint32_t RESERVED27                     : 1;
    __IO uint32_t SRAMR_WWT                 : 3;
    uint32_t RESERVED31                     : 1;
} stc_sramc_wtcr_field_t;

typedef struct
{
    __IO uint32_t WTPRC                     : 1;
    __IO uint32_t WTPRKW                    : 7;
    uint32_t RESERVED8                      :24;
} stc_sramc_wtpr_field_t;

typedef struct
{
    __IO uint32_t PYOAD                     : 1;
    uint32_t RESERVED1                      :15;
    __IO uint32_t ECCOAD                    : 1;
    uint32_t RESERVED17                     : 7;
    __IO uint32_t ECCMOD                    : 2;
    uint32_t RESERVED26                     : 6;
} stc_sramc_ckcr_field_t;

typedef struct
{
    __IO uint32_t CKPRC                     : 1;
    __IO uint32_t CKPRKW                    : 7;
    uint32_t RESERVED8                      :24;
} stc_sramc_ckpr_field_t;

typedef struct
{
    __IO uint32_t SRAM3_1ERR                : 1;
    __IO uint32_t SRAM3_2ERR                : 1;
    __IO uint32_t SRAM12_PYERR              : 1;
    __IO uint32_t SRAMH_PYERR               : 1;
    __IO uint32_t SRAMR_PYERR               : 1;
    uint32_t RESERVED5                      :27;
} stc_sramc_cksr_field_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    __IO uint32_t UDF                       : 1;
    __IO uint32_t REF                       : 1;
    uint32_t RESERVED18                     :14;
} stc_swdt_sr_field_t;

typedef struct
{
    __IO uint32_t RF                        :16;
    uint32_t RESERVED16                     :16;
} stc_swdt_rr_field_t;

typedef struct
{
    __IO uint16_t FLNWT                     : 1;
    __IO uint16_t CKSMRC                    : 1;
    uint16_t RESERVED2                      :13;
    __IO uint16_t STOP                      : 1;
} stc_sysreg_pwr_stpmcr_field_t;

typedef struct
{
    __IO uint16_t PERICKSEL                 : 4;
    uint16_t RESERVED4                      :12;
} stc_sysreg_cmu_pericksel_field_t;

typedef struct
{
    __IO uint16_t I2S1CKSEL                 : 4;
    __IO uint16_t I2S2CKSEL                 : 4;
    __IO uint16_t I2S3CKSEL                 : 4;
    __IO uint16_t I2S4CKSEL                 : 4;
} stc_sysreg_cmu_i2scksel_field_t;

typedef struct
{
    __IO uint32_t RAMPDC0                   : 1;
    __IO uint32_t RAMPDC1                   : 1;
    __IO uint32_t RAMPDC2                   : 1;
    __IO uint32_t RAMPDC3                   : 1;
    __IO uint32_t RAMPDC4                   : 1;
    __IO uint32_t RAMPDC5                   : 1;
    __IO uint32_t RAMPDC6                   : 1;
    __IO uint32_t RAMPDC7                   : 1;
    __IO uint32_t RAMPDC8                   : 1;
    uint32_t RESERVED9                      :23;
} stc_sysreg_pwr_rampc0_field_t;

typedef struct
{
    __IO uint32_t AESRDP                    : 1;
    __IO uint32_t AESWRP                    : 1;
    __IO uint32_t HASHRDP                   : 1;
    __IO uint32_t HASHWRP                   : 1;
    __IO uint32_t TRNGRDP                   : 1;
    __IO uint32_t TRNGWRP                   : 1;
    __IO uint32_t CRCRDP                    : 1;
    __IO uint32_t CRCWRP                    : 1;
    __IO uint32_t FMCRDP                    : 1;
    __IO uint32_t FMCWRP                    : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t WDTRDP                    : 1;
    __IO uint32_t WDTWRP                    : 1;
    __IO uint32_t SWDTRDP                   : 1;
    __IO uint32_t SWDTWRP                   : 1;
    __IO uint32_t BKSRAMRDP                 : 1;
    __IO uint32_t BKSRAMWRP                 : 1;
    __IO uint32_t RTCRDP                    : 1;
    __IO uint32_t RTCWRP                    : 1;
    __IO uint32_t DMPURDP                   : 1;
    __IO uint32_t DMPUWRP                   : 1;
    __IO uint32_t SRAMCRDP                  : 1;
    __IO uint32_t SRAMCWRP                  : 1;
    __IO uint32_t INTCRDP                   : 1;
    __IO uint32_t INTCWRP                   : 1;
    __IO uint32_t SYSCRDP                   : 1;
    __IO uint32_t SYSCWRP                   : 1;
    __IO uint32_t MSTPRDP                   : 1;
    __IO uint32_t MSTPWRP                   : 1;
    uint32_t RESERVED30                     : 1;
    __IO uint32_t BUSERRE                   : 1;
} stc_sysreg_mpu_ippr_field_t;

typedef struct
{
    __IO uint32_t PCLK0S                    : 3;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t PCLK1S                    : 3;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t PCLK2S                    : 3;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t PCLK3S                    : 3;
    uint32_t RESERVED15                     : 1;
    __IO uint32_t PCLK4S                    : 3;
    uint32_t RESERVED19                     : 1;
    __IO uint32_t EXCKS                     : 3;
    uint32_t RESERVED23                     : 1;
    __IO uint32_t HCLKS                     : 3;
    uint32_t RESERVED27                     : 5;
} stc_sysreg_cmu_scfgr_field_t;

typedef struct
{
    uint8_t RESERVED0                       : 4;
    __IO uint8_t USBCKS                     : 4;
} stc_sysreg_cmu_ufsckcfgr_field_t;

typedef struct
{
    __IO uint8_t CKSW                       : 3;
    uint8_t RESERVED3                       : 5;
} stc_sysreg_cmu_ckswr_field_t;

typedef struct
{
    __IO uint8_t MPLLOFF                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_pllcr_field_t;

typedef struct
{
    __IO uint8_t UPLLOFF                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_upllcr_field_t;

typedef struct
{
    __IO uint8_t XTALSTP                    : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_xtalcr_field_t;

typedef struct
{
    __IO uint8_t HRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_hrccr_field_t;

typedef struct
{
    __IO uint8_t MRCSTP                     : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_mrccr_field_t;

typedef struct
{
    __IO uint8_t HRCSTBF                    : 1;
    uint8_t RESERVED1                       : 2;
    __IO uint8_t XTALSTBF                   : 1;
    uint8_t RESERVED4                       : 1;
    __IO uint8_t MPLLSTBF                   : 1;
    __IO uint8_t UPLLSTBF                   : 1;
    uint8_t RESERVED7                       : 1;
} stc_sysreg_cmu_oscstbsr_field_t;

typedef struct
{
    __IO uint8_t MCO1SEL                    : 4;
    __IO uint8_t MCO1DIV                    : 3;
    __IO uint8_t MCO1EN                     : 1;
} stc_sysreg_cmu_mco1cfgr_field_t;

typedef struct
{
    __IO uint8_t MCO2SEL                    : 4;
    __IO uint8_t MCO2DIV                    : 3;
    __IO uint8_t MCO2EN                     : 1;
} stc_sysreg_cmu_mco2cfgr_field_t;

typedef struct
{
    __IO uint8_t TPIUCKS                    : 2;
    uint8_t RESERVED2                       : 5;
    __IO uint8_t TPIUCKOE                   : 1;
} stc_sysreg_cmu_tpiuckcfgr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDIE                  : 1;
    __IO uint8_t XTALSTDRE                  : 1;
    __IO uint8_t XTALSTDRIS                 : 1;
    uint8_t RESERVED3                       : 4;
    __IO uint8_t XTALSTDE                   : 1;
} stc_sysreg_cmu_xtalstdcr_field_t;

typedef struct
{
    __IO uint8_t XTALSTDF                   : 1;
    uint8_t RESERVED1                       : 7;
} stc_sysreg_cmu_xtalstdsr_field_t;

typedef struct
{
    __IO uint8_t XTALSTB                    : 4;
    uint8_t RESERVED4                       : 4;
} stc_sysreg_cmu_xtalstbcr_field_t;

typedef struct
{
    __IO uint16_t PORF                      : 1;
    __IO uint16_t PINRF                     : 1;
    __IO uint16_t BORF                      : 1;
    __IO uint16_t PVD1RF                    : 1;
    __IO uint16_t PVD2RF                    : 1;
    __IO uint16_t WDRF                      : 1;
    __IO uint16_t SWDRF                     : 1;
    __IO uint16_t PDRF                      : 1;
    __IO uint16_t SWRF                      : 1;
    __IO uint16_t MPUERF                    : 1;
    __IO uint16_t RAPERF                    : 1;
    __IO uint16_t RAECRF                    : 1;
    __IO uint16_t CKFERF                    : 1;
    __IO uint16_t XTALERF                   : 1;
    __IO uint16_t MULTIRF                   : 1;
    __IO uint16_t CLRF                      : 1;
} stc_sysreg_rmu_rstf0_field_t;

typedef struct
{
    __IO uint8_t PVD1NMIS                   : 1;
    uint8_t RESERVED1                       : 3;
    __IO uint8_t PVD2NMIS                   : 1;
    uint8_t RESERVED5                       : 3;
} stc_sysreg_pwr_pvdicr_field_t;

typedef struct
{
    __IO uint8_t PVD1MON                    : 1;
    __IO uint8_t PVD1DETFLG                 : 1;
    uint8_t RESERVED2                       : 2;
    __IO uint8_t PVD2MON                    : 1;
    __IO uint8_t PVD2DETFLG                 : 1;
    uint8_t RESERVED6                       : 2;
} stc_sysreg_pwr_pvddsr_field_t;

typedef struct
{
    __IO uint32_t MPLLM                     : 5;
    uint32_t RESERVED5                      : 2;
    __IO uint32_t PLLSRC                    : 1;
    __IO uint32_t MPLLN                     : 9;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t MPLLR                     : 4;
    __IO uint32_t MPLLQ                     : 4;
    __IO uint32_t MPLLP                     : 4;
} stc_sysreg_cmu_pllcfgr_field_t;

typedef struct
{
    __IO uint32_t UPLLM                     : 5;
    uint32_t RESERVED5                      : 3;
    __IO uint32_t UPLLN                     : 9;
    uint32_t RESERVED17                     : 3;
    __IO uint32_t UPLLR                     : 4;
    __IO uint32_t UPLLQ                     : 4;
    __IO uint32_t UPLLP                     : 4;
} stc_sysreg_cmu_upllcfgr_field_t;

typedef struct
{
    __IO uint16_t FPRCB0                    : 1;
    __IO uint16_t FPRCB1                    : 1;
    __IO uint16_t FPRCB2                    : 1;
    __IO uint16_t FPRCB3                    : 1;
    uint16_t RESERVED4                      : 4;
    __IO uint16_t FPRCWE                    : 8;
} stc_sysreg_pwr_fprc_field_t;

typedef struct
{
    __IO uint8_t PDMDS                      : 2;
    __IO uint8_t VVDRSD                     : 1;
    __IO uint8_t RETRAMSD                   : 1;
    __IO uint8_t IORTN                      : 2;
    uint8_t RESERVED6                       : 1;
    __IO uint8_t PWDN                       : 1;
} stc_sysreg_pwr_pwrc0_field_t;

