SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pctb_template/common/hc32f460pctb.h
#define bM4_I2C3_SLR0_SLADDR09                    (*((volatile unsigned int*)(0x429D0224UL)))
#define bM4_I2C3_SLR0_SLADDR0EN                   (*((volatile unsigned int*)(0x429D0230UL)))
#define bM4_I2C3_SLR0_ADDRMOD0                    (*((volatile unsigned int*)(0x429D023CUL)))
#define bM4_I2C3_SLR1_SLADDR10                    (*((volatile unsigned int*)(0x429D0280UL)))
#define bM4_I2C3_SLR1_SLADDR11                    (*((volatile unsigned int*)(0x429D0284UL)))
#define bM4_I2C3_SLR1_SLADDR12                    (*((volatile unsigned int*)(0x429D0288UL)))
#define bM4_I2C3_SLR1_SLADDR13                    (*((volatile unsigned int*)(0x429D028CUL)))
#define bM4_I2C3_SLR1_SLADDR14                    (*((volatile unsigned int*)(0x429D0290UL)))
#define bM4_I2C3_SLR1_SLADDR15                    (*((volatile unsigned int*)(0x429D0294UL)))
#define bM4_I2C3_SLR1_SLADDR16                    (*((volatile unsigned int*)(0x429D0298UL)))
#define bM4_I2C3_SLR1_SLADDR17                    (*((volatile unsigned int*)(0x429D029CUL)))
#define bM4_I2C3_SLR1_SLADDR18                    (*((volatile unsigned int*)(0x429D02A0UL)))
#define bM4_I2C3_SLR1_SLADDR19                    (*((volatile unsigned int*)(0x429D02A4UL)))
#define bM4_I2C3_SLR1_SLADDR1EN                   (*((volatile unsigned int*)(0x429D02B0UL)))
#define bM4_I2C3_SLR1_ADDRMOD1                    (*((volatile unsigned int*)(0x429D02BCUL)))
#define bM4_I2C3_SLTR_TOUTLOW0                    (*((volatile unsigned int*)(0x429D0300UL)))
#define bM4_I2C3_SLTR_TOUTLOW1                    (*((volatile unsigned int*)(0x429D0304UL)))
#define bM4_I2C3_SLTR_TOUTLOW2                    (*((volatile unsigned int*)(0x429D0308UL)))
#define bM4_I2C3_SLTR_TOUTLOW3                    (*((volatile unsigned int*)(0x429D030CUL)))
#define bM4_I2C3_SLTR_TOUTLOW4                    (*((volatile unsigned int*)(0x429D0310UL)))
#define bM4_I2C3_SLTR_TOUTLOW5                    (*((volatile unsigned int*)(0x429D0314UL)))
#define bM4_I2C3_SLTR_TOUTLOW6                    (*((volatile unsigned int*)(0x429D0318UL)))
#define bM4_I2C3_SLTR_TOUTLOW7                    (*((volatile unsigned int*)(0x429D031CUL)))
#define bM4_I2C3_SLTR_TOUTLOW8                    (*((volatile unsigned int*)(0x429D0320UL)))
#define bM4_I2C3_SLTR_TOUTLOW9                    (*((volatile unsigned int*)(0x429D0324UL)))
#define bM4_I2C3_SLTR_TOUTLOW10                   (*((volatile unsigned int*)(0x429D0328UL)))
#define bM4_I2C3_SLTR_TOUTLOW11                   (*((volatile unsigned int*)(0x429D032CUL)))
#define bM4_I2C3_SLTR_TOUTLOW12                   (*((volatile unsigned int*)(0x429D0330UL)))
#define bM4_I2C3_SLTR_TOUTLOW13                   (*((volatile unsigned int*)(0x429D0334UL)))
#define bM4_I2C3_SLTR_TOUTLOW14                   (*((volatile unsigned int*)(0x429D0338UL)))
#define bM4_I2C3_SLTR_TOUTLOW15                   (*((volatile unsigned int*)(0x429D033CUL)))
#define bM4_I2C3_SLTR_TOUTHIGH0                   (*((volatile unsigned int*)(0x429D0340UL)))
#define bM4_I2C3_SLTR_TOUTHIGH1                   (*((volatile unsigned int*)(0x429D0344UL)))
#define bM4_I2C3_SLTR_TOUTHIGH2                   (*((volatile unsigned int*)(0x429D0348UL)))
#define bM4_I2C3_SLTR_TOUTHIGH3                   (*((volatile unsigned int*)(0x429D034CUL)))
#define bM4_I2C3_SLTR_TOUTHIGH4                   (*((volatile unsigned int*)(0x429D0350UL)))
#define bM4_I2C3_SLTR_TOUTHIGH5                   (*((volatile unsigned int*)(0x429D0354UL)))
#define bM4_I2C3_SLTR_TOUTHIGH6                   (*((volatile unsigned int*)(0x429D0358UL)))
#define bM4_I2C3_SLTR_TOUTHIGH7                   (*((volatile unsigned int*)(0x429D035CUL)))
#define bM4_I2C3_SLTR_TOUTHIGH8                   (*((volatile unsigned int*)(0x429D0360UL)))
#define bM4_I2C3_SLTR_TOUTHIGH9                   (*((volatile unsigned int*)(0x429D0364UL)))
#define bM4_I2C3_SLTR_TOUTHIGH10                  (*((volatile unsigned int*)(0x429D0368UL)))
#define bM4_I2C3_SLTR_TOUTHIGH11                  (*((volatile unsigned int*)(0x429D036CUL)))
#define bM4_I2C3_SLTR_TOUTHIGH12                  (*((volatile unsigned int*)(0x429D0370UL)))
#define bM4_I2C3_SLTR_TOUTHIGH13                  (*((volatile unsigned int*)(0x429D0374UL)))
#define bM4_I2C3_SLTR_TOUTHIGH14                  (*((volatile unsigned int*)(0x429D0378UL)))
#define bM4_I2C3_SLTR_TOUTHIGH15                  (*((volatile unsigned int*)(0x429D037CUL)))
#define bM4_I2C3_SR_STARTF                        (*((volatile unsigned int*)(0x429D0380UL)))
#define bM4_I2C3_SR_SLADDR0F                      (*((volatile unsigned int*)(0x429D0384UL)))
#define bM4_I2C3_SR_SLADDR1F                      (*((volatile unsigned int*)(0x429D0388UL)))
#define bM4_I2C3_SR_TENDF                         (*((volatile unsigned int*)(0x429D038CUL)))
#define bM4_I2C3_SR_STOPF                         (*((volatile unsigned int*)(0x429D0390UL)))
#define bM4_I2C3_SR_RFULLF                        (*((volatile unsigned int*)(0x429D0398UL)))
#define bM4_I2C3_SR_TEMPTYF                       (*((volatile unsigned int*)(0x429D039CUL)))
#define bM4_I2C3_SR_ARLOF                         (*((volatile unsigned int*)(0x429D03A4UL)))
#define bM4_I2C3_SR_ACKRF                         (*((volatile unsigned int*)(0x429D03A8UL)))
#define bM4_I2C3_SR_NACKF                         (*((volatile unsigned int*)(0x429D03B0UL)))
#define bM4_I2C3_SR_TMOUTF                        (*((volatile unsigned int*)(0x429D03B8UL)))
#define bM4_I2C3_SR_MSL                           (*((volatile unsigned int*)(0x429D03C0UL)))
#define bM4_I2C3_SR_BUSY                          (*((volatile unsigned int*)(0x429D03C4UL)))
#define bM4_I2C3_SR_TRA                           (*((volatile unsigned int*)(0x429D03C8UL)))
#define bM4_I2C3_SR_GENCALLF                      (*((volatile unsigned int*)(0x429D03D0UL)))
#define bM4_I2C3_SR_SMBDEFAULTF                   (*((volatile unsigned int*)(0x429D03D4UL)))
#define bM4_I2C3_SR_SMBHOSTF                      (*((volatile unsigned int*)(0x429D03D8UL)))
#define bM4_I2C3_SR_SMBALRTF                      (*((volatile unsigned int*)(0x429D03DCUL)))
#define bM4_I2C3_CLR_STARTFCLR                    (*((volatile unsigned int*)(0x429D0400UL)))
#define bM4_I2C3_CLR_SLADDR0FCLR                  (*((volatile unsigned int*)(0x429D0404UL)))
#define bM4_I2C3_CLR_SLADDR1FCLR                  (*((volatile unsigned int*)(0x429D0408UL)))
#define bM4_I2C3_CLR_TENDFCLR                     (*((volatile unsigned int*)(0x429D040CUL)))
#define bM4_I2C3_CLR_STOPFCLR                     (*((volatile unsigned int*)(0x429D0410UL)))
#define bM4_I2C3_CLR_RFULLFCLR                    (*((volatile unsigned int*)(0x429D0418UL)))
#define bM4_I2C3_CLR_TEMPTYFCLR                   (*((volatile unsigned int*)(0x429D041CUL)))
#define bM4_I2C3_CLR_ARLOFCLR                     (*((volatile unsigned int*)(0x429D0424UL)))
#define bM4_I2C3_CLR_NACKFCLR                     (*((volatile unsigned int*)(0x429D0430UL)))
#define bM4_I2C3_CLR_TMOUTFCLR                    (*((volatile unsigned int*)(0x429D0438UL)))
#define bM4_I2C3_CLR_GENCALLFCLR                  (*((volatile unsigned int*)(0x429D0450UL)))
#define bM4_I2C3_CLR_SMBDEFAULTFCLR               (*((volatile unsigned int*)(0x429D0454UL)))
#define bM4_I2C3_CLR_SMBHOSTFCLR                  (*((volatile unsigned int*)(0x429D0458UL)))
#define bM4_I2C3_CLR_SMBALRTFCLR                  (*((volatile unsigned int*)(0x429D045CUL)))
#define bM4_I2C3_DTR_DT0                          (*((volatile unsigned int*)(0x429D0480UL)))
#define bM4_I2C3_DTR_DT1                          (*((volatile unsigned int*)(0x429D0484UL)))
#define bM4_I2C3_DTR_DT2                          (*((volatile unsigned int*)(0x429D0488UL)))
#define bM4_I2C3_DTR_DT3                          (*((volatile unsigned int*)(0x429D048CUL)))
#define bM4_I2C3_DTR_DT4                          (*((volatile unsigned int*)(0x429D0490UL)))
#define bM4_I2C3_DTR_DT5                          (*((volatile unsigned int*)(0x429D0494UL)))
#define bM4_I2C3_DTR_DT6                          (*((volatile unsigned int*)(0x429D0498UL)))
#define bM4_I2C3_DTR_DT7                          (*((volatile unsigned int*)(0x429D049CUL)))
#define bM4_I2C3_DRR_DR0                          (*((volatile unsigned int*)(0x429D0500UL)))
#define bM4_I2C3_DRR_DR1                          (*((volatile unsigned int*)(0x429D0504UL)))
#define bM4_I2C3_DRR_DR2                          (*((volatile unsigned int*)(0x429D0508UL)))
#define bM4_I2C3_DRR_DR3                          (*((volatile unsigned int*)(0x429D050CUL)))
#define bM4_I2C3_DRR_DR4                          (*((volatile unsigned int*)(0x429D0510UL)))
#define bM4_I2C3_DRR_DR5                          (*((volatile unsigned int*)(0x429D0514UL)))
#define bM4_I2C3_DRR_DR6                          (*((volatile unsigned int*)(0x429D0518UL)))
#define bM4_I2C3_DRR_DR7                          (*((volatile unsigned int*)(0x429D051CUL)))
#define bM4_I2C3_CCR_SLOWW0                       (*((volatile unsigned int*)(0x429D0580UL)))
#define bM4_I2C3_CCR_SLOWW1                       (*((volatile unsigned int*)(0x429D0584UL)))
#define bM4_I2C3_CCR_SLOWW2                       (*((volatile unsigned int*)(0x429D0588UL)))
#define bM4_I2C3_CCR_SLOWW3                       (*((volatile unsigned int*)(0x429D058CUL)))
#define bM4_I2C3_CCR_SLOWW4                       (*((volatile unsigned int*)(0x429D0590UL)))
#define bM4_I2C3_CCR_SHIGHW0                      (*((volatile unsigned int*)(0x429D05A0UL)))
#define bM4_I2C3_CCR_SHIGHW1                      (*((volatile unsigned int*)(0x429D05A4UL)))
#define bM4_I2C3_CCR_SHIGHW2                      (*((volatile unsigned int*)(0x429D05A8UL)))
#define bM4_I2C3_CCR_SHIGHW3                      (*((volatile unsigned int*)(0x429D05ACUL)))
#define bM4_I2C3_CCR_SHIGHW4                      (*((volatile unsigned int*)(0x429D05B0UL)))
#define bM4_I2C3_CCR_FREQ0                        (*((volatile unsigned int*)(0x429D05C0UL)))
#define bM4_I2C3_CCR_FREQ1                        (*((volatile unsigned int*)(0x429D05C4UL)))
#define bM4_I2C3_CCR_FREQ2                        (*((volatile unsigned int*)(0x429D05C8UL)))
#define bM4_I2C3_FLTR_DNF0                        (*((volatile unsigned int*)(0x429D0600UL)))
#define bM4_I2C3_FLTR_DNF1                        (*((volatile unsigned int*)(0x429D0604UL)))
#define bM4_I2C3_FLTR_DNFEN                       (*((volatile unsigned int*)(0x429D0610UL)))
#define bM4_I2C3_FLTR_ANFEN                       (*((volatile unsigned int*)(0x429D0614UL)))
#define bM4_I2S1_CTRL_TXE                         (*((volatile unsigned int*)(0x423C0000UL)))
#define bM4_I2S1_CTRL_TXIE                        (*((volatile unsigned int*)(0x423C0004UL)))
#define bM4_I2S1_CTRL_RXE                         (*((volatile unsigned int*)(0x423C0008UL)))
#define bM4_I2S1_CTRL_RXIE                        (*((volatile unsigned int*)(0x423C000CUL)))
#define bM4_I2S1_CTRL_EIE                         (*((volatile unsigned int*)(0x423C0010UL)))
#define bM4_I2S1_CTRL_WMS                         (*((volatile unsigned int*)(0x423C0014UL)))
#define bM4_I2S1_CTRL_ODD                         (*((volatile unsigned int*)(0x423C0018UL)))
#define bM4_I2S1_CTRL_MCKOE                       (*((volatile unsigned int*)(0x423C001CUL)))
#define bM4_I2S1_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x423C0020UL)))
#define bM4_I2S1_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x423C0024UL)))
#define bM4_I2S1_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x423C0028UL)))
#define bM4_I2S1_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x423C0030UL)))
#define bM4_I2S1_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x423C0034UL)))
#define bM4_I2S1_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x423C0038UL)))
#define bM4_I2S1_CTRL_FIFOR                       (*((volatile unsigned int*)(0x423C0040UL)))
#define bM4_I2S1_CTRL_CODECRC                     (*((volatile unsigned int*)(0x423C0044UL)))
#define bM4_I2S1_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x423C0048UL)))
#define bM4_I2S1_CTRL_SDOE                        (*((volatile unsigned int*)(0x423C004CUL)))
#define bM4_I2S1_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x423C0050UL)))
#define bM4_I2S1_CTRL_CKOE                        (*((volatile unsigned int*)(0x423C0054UL)))
#define bM4_I2S1_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x423C0058UL)))
#define bM4_I2S1_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x423C005CUL)))
#define bM4_I2S1_SR_TXBA                          (*((volatile unsigned int*)(0x423C0080UL)))
#define bM4_I2S1_SR_RXBA                          (*((volatile unsigned int*)(0x423C0084UL)))
#define bM4_I2S1_SR_TXBE                          (*((volatile unsigned int*)(0x423C0088UL)))
#define bM4_I2S1_SR_TXBF                          (*((volatile unsigned int*)(0x423C008CUL)))
#define bM4_I2S1_SR_RXBE                          (*((volatile unsigned int*)(0x423C0090UL)))
#define bM4_I2S1_SR_RXBF                          (*((volatile unsigned int*)(0x423C0094UL)))
#define bM4_I2S1_ER_TXERR                         (*((volatile unsigned int*)(0x423C0100UL)))
#define bM4_I2S1_ER_RXERR                         (*((volatile unsigned int*)(0x423C0104UL)))
#define bM4_I2S1_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x423C0180UL)))
#define bM4_I2S1_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x423C0184UL)))
#define bM4_I2S1_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x423C0188UL)))
#define bM4_I2S1_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x423C018CUL)))
#define bM4_I2S1_CFGR_CHLEN                       (*((volatile unsigned int*)(0x423C0190UL)))
#define bM4_I2S1_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x423C0194UL)))
#define bM4_I2S1_PR_I2SDIV0                       (*((volatile unsigned int*)(0x423C0300UL)))
#define bM4_I2S1_PR_I2SDIV1                       (*((volatile unsigned int*)(0x423C0304UL)))
#define bM4_I2S1_PR_I2SDIV2                       (*((volatile unsigned int*)(0x423C0308UL)))
#define bM4_I2S1_PR_I2SDIV3                       (*((volatile unsigned int*)(0x423C030CUL)))
#define bM4_I2S1_PR_I2SDIV4                       (*((volatile unsigned int*)(0x423C0310UL)))
#define bM4_I2S1_PR_I2SDIV5                       (*((volatile unsigned int*)(0x423C0314UL)))
#define bM4_I2S1_PR_I2SDIV6                       (*((volatile unsigned int*)(0x423C0318UL)))
#define bM4_I2S1_PR_I2SDIV7                       (*((volatile unsigned int*)(0x423C031CUL)))
#define bM4_I2S2_CTRL_TXE                         (*((volatile unsigned int*)(0x423C8000UL)))
#define bM4_I2S2_CTRL_TXIE                        (*((volatile unsigned int*)(0x423C8004UL)))
#define bM4_I2S2_CTRL_RXE                         (*((volatile unsigned int*)(0x423C8008UL)))
#define bM4_I2S2_CTRL_RXIE                        (*((volatile unsigned int*)(0x423C800CUL)))
#define bM4_I2S2_CTRL_EIE                         (*((volatile unsigned int*)(0x423C8010UL)))
#define bM4_I2S2_CTRL_WMS                         (*((volatile unsigned int*)(0x423C8014UL)))
#define bM4_I2S2_CTRL_ODD                         (*((volatile unsigned int*)(0x423C8018UL)))
#define bM4_I2S2_CTRL_MCKOE                       (*((volatile unsigned int*)(0x423C801CUL)))
#define bM4_I2S2_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x423C8020UL)))
#define bM4_I2S2_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x423C8024UL)))
#define bM4_I2S2_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x423C8028UL)))
#define bM4_I2S2_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x423C8030UL)))
#define bM4_I2S2_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x423C8034UL)))
#define bM4_I2S2_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x423C8038UL)))
#define bM4_I2S2_CTRL_FIFOR                       (*((volatile unsigned int*)(0x423C8040UL)))
#define bM4_I2S2_CTRL_CODECRC                     (*((volatile unsigned int*)(0x423C8044UL)))
#define bM4_I2S2_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x423C8048UL)))
#define bM4_I2S2_CTRL_SDOE                        (*((volatile unsigned int*)(0x423C804CUL)))
#define bM4_I2S2_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x423C8050UL)))
#define bM4_I2S2_CTRL_CKOE                        (*((volatile unsigned int*)(0x423C8054UL)))
#define bM4_I2S2_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x423C8058UL)))
#define bM4_I2S2_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x423C805CUL)))
#define bM4_I2S2_SR_TXBA                          (*((volatile unsigned int*)(0x423C8080UL)))
#define bM4_I2S2_SR_RXBA                          (*((volatile unsigned int*)(0x423C8084UL)))
#define bM4_I2S2_SR_TXBE                          (*((volatile unsigned int*)(0x423C8088UL)))
#define bM4_I2S2_SR_TXBF                          (*((volatile unsigned int*)(0x423C808CUL)))
#define bM4_I2S2_SR_RXBE                          (*((volatile unsigned int*)(0x423C8090UL)))
#define bM4_I2S2_SR_RXBF                          (*((volatile unsigned int*)(0x423C8094UL)))
#define bM4_I2S2_ER_TXERR                         (*((volatile unsigned int*)(0x423C8100UL)))
#define bM4_I2S2_ER_RXERR                         (*((volatile unsigned int*)(0x423C8104UL)))
#define bM4_I2S2_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x423C8180UL)))
#define bM4_I2S2_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x423C8184UL)))
#define bM4_I2S2_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x423C8188UL)))
#define bM4_I2S2_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x423C818CUL)))
#define bM4_I2S2_CFGR_CHLEN                       (*((volatile unsigned int*)(0x423C8190UL)))
#define bM4_I2S2_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x423C8194UL)))
#define bM4_I2S2_PR_I2SDIV0                       (*((volatile unsigned int*)(0x423C8300UL)))
#define bM4_I2S2_PR_I2SDIV1                       (*((volatile unsigned int*)(0x423C8304UL)))
#define bM4_I2S2_PR_I2SDIV2                       (*((volatile unsigned int*)(0x423C8308UL)))
#define bM4_I2S2_PR_I2SDIV3                       (*((volatile unsigned int*)(0x423C830CUL)))
#define bM4_I2S2_PR_I2SDIV4                       (*((volatile unsigned int*)(0x423C8310UL)))
#define bM4_I2S2_PR_I2SDIV5                       (*((volatile unsigned int*)(0x423C8314UL)))
#define bM4_I2S2_PR_I2SDIV6                       (*((volatile unsigned int*)(0x423C8318UL)))
#define bM4_I2S2_PR_I2SDIV7                       (*((volatile unsigned int*)(0x423C831CUL)))
#define bM4_I2S3_CTRL_TXE                         (*((volatile unsigned int*)(0x42440000UL)))
#define bM4_I2S3_CTRL_TXIE                        (*((volatile unsigned int*)(0x42440004UL)))
#define bM4_I2S3_CTRL_RXE                         (*((volatile unsigned int*)(0x42440008UL)))
#define bM4_I2S3_CTRL_RXIE                        (*((volatile unsigned int*)(0x4244000CUL)))
#define bM4_I2S3_CTRL_EIE                         (*((volatile unsigned int*)(0x42440010UL)))
#define bM4_I2S3_CTRL_WMS                         (*((volatile unsigned int*)(0x42440014UL)))
#define bM4_I2S3_CTRL_ODD                         (*((volatile unsigned int*)(0x42440018UL)))
#define bM4_I2S3_CTRL_MCKOE                       (*((volatile unsigned int*)(0x4244001CUL)))
#define bM4_I2S3_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x42440020UL)))
#define bM4_I2S3_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x42440024UL)))
#define bM4_I2S3_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x42440028UL)))
#define bM4_I2S3_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x42440030UL)))
#define bM4_I2S3_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x42440034UL)))
#define bM4_I2S3_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x42440038UL)))
#define bM4_I2S3_CTRL_FIFOR                       (*((volatile unsigned int*)(0x42440040UL)))
#define bM4_I2S3_CTRL_CODECRC                     (*((volatile unsigned int*)(0x42440044UL)))
#define bM4_I2S3_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x42440048UL)))
#define bM4_I2S3_CTRL_SDOE                        (*((volatile unsigned int*)(0x4244004CUL)))
#define bM4_I2S3_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x42440050UL)))
#define bM4_I2S3_CTRL_CKOE                        (*((volatile unsigned int*)(0x42440054UL)))
#define bM4_I2S3_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x42440058UL)))
#define bM4_I2S3_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x4244005CUL)))
#define bM4_I2S3_SR_TXBA                          (*((volatile unsigned int*)(0x42440080UL)))
#define bM4_I2S3_SR_RXBA                          (*((volatile unsigned int*)(0x42440084UL)))
#define bM4_I2S3_SR_TXBE                          (*((volatile unsigned int*)(0x42440088UL)))
#define bM4_I2S3_SR_TXBF                          (*((volatile unsigned int*)(0x4244008CUL)))
#define bM4_I2S3_SR_RXBE                          (*((volatile unsigned int*)(0x42440090UL)))
#define bM4_I2S3_SR_RXBF                          (*((volatile unsigned int*)(0x42440094UL)))
#define bM4_I2S3_ER_TXERR                         (*((volatile unsigned int*)(0x42440100UL)))
#define bM4_I2S3_ER_RXERR                         (*((volatile unsigned int*)(0x42440104UL)))
#define bM4_I2S3_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x42440180UL)))
#define bM4_I2S3_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x42440184UL)))
#define bM4_I2S3_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x42440188UL)))
#define bM4_I2S3_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x4244018CUL)))
#define bM4_I2S3_CFGR_CHLEN                       (*((volatile unsigned int*)(0x42440190UL)))
#define bM4_I2S3_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x42440194UL)))
#define bM4_I2S3_PR_I2SDIV0                       (*((volatile unsigned int*)(0x42440300UL)))
#define bM4_I2S3_PR_I2SDIV1                       (*((volatile unsigned int*)(0x42440304UL)))
#define bM4_I2S3_PR_I2SDIV2                       (*((volatile unsigned int*)(0x42440308UL)))
#define bM4_I2S3_PR_I2SDIV3                       (*((volatile unsigned int*)(0x4244030CUL)))
#define bM4_I2S3_PR_I2SDIV4                       (*((volatile unsigned int*)(0x42440310UL)))
#define bM4_I2S3_PR_I2SDIV5                       (*((volatile unsigned int*)(0x42440314UL)))
#define bM4_I2S3_PR_I2SDIV6                       (*((volatile unsigned int*)(0x42440318UL)))
#define bM4_I2S3_PR_I2SDIV7                       (*((volatile unsigned int*)(0x4244031CUL)))
#define bM4_I2S4_CTRL_TXE                         (*((volatile unsigned int*)(0x42448000UL)))
#define bM4_I2S4_CTRL_TXIE                        (*((volatile unsigned int*)(0x42448004UL)))
#define bM4_I2S4_CTRL_RXE                         (*((volatile unsigned int*)(0x42448008UL)))
#define bM4_I2S4_CTRL_RXIE                        (*((volatile unsigned int*)(0x4244800CUL)))
#define bM4_I2S4_CTRL_EIE                         (*((volatile unsigned int*)(0x42448010UL)))
#define bM4_I2S4_CTRL_WMS                         (*((volatile unsigned int*)(0x42448014UL)))
#define bM4_I2S4_CTRL_ODD                         (*((volatile unsigned int*)(0x42448018UL)))
#define bM4_I2S4_CTRL_MCKOE                       (*((volatile unsigned int*)(0x4244801CUL)))
#define bM4_I2S4_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x42448020UL)))
#define bM4_I2S4_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x42448024UL)))
#define bM4_I2S4_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x42448028UL)))
