SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pctb_template/common/hc32f460pctb.h
#define bM4_PORT_PCRA15_POUT                      (*((volatile unsigned int*)(0x42A78780UL)))
#define bM4_PORT_PCRA15_POUTE                     (*((volatile unsigned int*)(0x42A78784UL)))
#define bM4_PORT_PCRA15_NOD                       (*((volatile unsigned int*)(0x42A78788UL)))
#define bM4_PORT_PCRA15_DRV0                      (*((volatile unsigned int*)(0x42A78790UL)))
#define bM4_PORT_PCRA15_DRV1                      (*((volatile unsigned int*)(0x42A78794UL)))
#define bM4_PORT_PCRA15_PUU                       (*((volatile unsigned int*)(0x42A78798UL)))
#define bM4_PORT_PCRA15_PIN                       (*((volatile unsigned int*)(0x42A787A0UL)))
#define bM4_PORT_PCRA15_INVE                      (*((volatile unsigned int*)(0x42A787A4UL)))
#define bM4_PORT_PCRA15_INTE                      (*((volatile unsigned int*)(0x42A787B0UL)))
#define bM4_PORT_PCRA15_LTE                       (*((volatile unsigned int*)(0x42A787B8UL)))
#define bM4_PORT_PCRA15_DDIS                      (*((volatile unsigned int*)(0x42A787BCUL)))
#define bM4_PORT_PFSRA15_FSEL0                    (*((volatile unsigned int*)(0x42A787C0UL)))
#define bM4_PORT_PFSRA15_FSEL1                    (*((volatile unsigned int*)(0x42A787C4UL)))
#define bM4_PORT_PFSRA15_FSEL2                    (*((volatile unsigned int*)(0x42A787C8UL)))
#define bM4_PORT_PFSRA15_FSEL3                    (*((volatile unsigned int*)(0x42A787CCUL)))
#define bM4_PORT_PFSRA15_FSEL4                    (*((volatile unsigned int*)(0x42A787D0UL)))
#define bM4_PORT_PFSRA15_FSEL5                    (*((volatile unsigned int*)(0x42A787D4UL)))
#define bM4_PORT_PFSRA15_BFE                      (*((volatile unsigned int*)(0x42A787E0UL)))
#define bM4_PORT_PCRB0_POUT                       (*((volatile unsigned int*)(0x42A78800UL)))
#define bM4_PORT_PCRB0_POUTE                      (*((volatile unsigned int*)(0x42A78804UL)))
#define bM4_PORT_PCRB0_NOD                        (*((volatile unsigned int*)(0x42A78808UL)))
#define bM4_PORT_PCRB0_DRV0                       (*((volatile unsigned int*)(0x42A78810UL)))
#define bM4_PORT_PCRB0_DRV1                       (*((volatile unsigned int*)(0x42A78814UL)))
#define bM4_PORT_PCRB0_PUU                        (*((volatile unsigned int*)(0x42A78818UL)))
#define bM4_PORT_PCRB0_PIN                        (*((volatile unsigned int*)(0x42A78820UL)))
#define bM4_PORT_PCRB0_INVE                       (*((volatile unsigned int*)(0x42A78824UL)))
#define bM4_PORT_PCRB0_INTE                       (*((volatile unsigned int*)(0x42A78830UL)))
#define bM4_PORT_PCRB0_LTE                        (*((volatile unsigned int*)(0x42A78838UL)))
#define bM4_PORT_PCRB0_DDIS                       (*((volatile unsigned int*)(0x42A7883CUL)))
#define bM4_PORT_PFSRB0_FSEL0                     (*((volatile unsigned int*)(0x42A78840UL)))
#define bM4_PORT_PFSRB0_FSEL1                     (*((volatile unsigned int*)(0x42A78844UL)))
#define bM4_PORT_PFSRB0_FSEL2                     (*((volatile unsigned int*)(0x42A78848UL)))
#define bM4_PORT_PFSRB0_FSEL3                     (*((volatile unsigned int*)(0x42A7884CUL)))
#define bM4_PORT_PFSRB0_FSEL4                     (*((volatile unsigned int*)(0x42A78850UL)))
#define bM4_PORT_PFSRB0_FSEL5                     (*((volatile unsigned int*)(0x42A78854UL)))
#define bM4_PORT_PFSRB0_BFE                       (*((volatile unsigned int*)(0x42A78860UL)))
#define bM4_PORT_PCRB1_POUT                       (*((volatile unsigned int*)(0x42A78880UL)))
#define bM4_PORT_PCRB1_POUTE                      (*((volatile unsigned int*)(0x42A78884UL)))
#define bM4_PORT_PCRB1_NOD                        (*((volatile unsigned int*)(0x42A78888UL)))
#define bM4_PORT_PCRB1_DRV0                       (*((volatile unsigned int*)(0x42A78890UL)))
#define bM4_PORT_PCRB1_DRV1                       (*((volatile unsigned int*)(0x42A78894UL)))
#define bM4_PORT_PCRB1_PUU                        (*((volatile unsigned int*)(0x42A78898UL)))
#define bM4_PORT_PCRB1_PIN                        (*((volatile unsigned int*)(0x42A788A0UL)))
#define bM4_PORT_PCRB1_INVE                       (*((volatile unsigned int*)(0x42A788A4UL)))
#define bM4_PORT_PCRB1_INTE                       (*((volatile unsigned int*)(0x42A788B0UL)))
#define bM4_PORT_PCRB1_LTE                        (*((volatile unsigned int*)(0x42A788B8UL)))
#define bM4_PORT_PCRB1_DDIS                       (*((volatile unsigned int*)(0x42A788BCUL)))
#define bM4_PORT_PFSRB1_FSEL0                     (*((volatile unsigned int*)(0x42A788C0UL)))
#define bM4_PORT_PFSRB1_FSEL1                     (*((volatile unsigned int*)(0x42A788C4UL)))
#define bM4_PORT_PFSRB1_FSEL2                     (*((volatile unsigned int*)(0x42A788C8UL)))
#define bM4_PORT_PFSRB1_FSEL3                     (*((volatile unsigned int*)(0x42A788CCUL)))
#define bM4_PORT_PFSRB1_FSEL4                     (*((volatile unsigned int*)(0x42A788D0UL)))
#define bM4_PORT_PFSRB1_FSEL5                     (*((volatile unsigned int*)(0x42A788D4UL)))
#define bM4_PORT_PFSRB1_BFE                       (*((volatile unsigned int*)(0x42A788E0UL)))
#define bM4_PORT_PCRB2_POUT                       (*((volatile unsigned int*)(0x42A78900UL)))
#define bM4_PORT_PCRB2_POUTE                      (*((volatile unsigned int*)(0x42A78904UL)))
#define bM4_PORT_PCRB2_NOD                        (*((volatile unsigned int*)(0x42A78908UL)))
#define bM4_PORT_PCRB2_DRV0                       (*((volatile unsigned int*)(0x42A78910UL)))
#define bM4_PORT_PCRB2_DRV1                       (*((volatile unsigned int*)(0x42A78914UL)))
#define bM4_PORT_PCRB2_PUU                        (*((volatile unsigned int*)(0x42A78918UL)))
#define bM4_PORT_PCRB2_PIN                        (*((volatile unsigned int*)(0x42A78920UL)))
#define bM4_PORT_PCRB2_INVE                       (*((volatile unsigned int*)(0x42A78924UL)))
#define bM4_PORT_PCRB2_INTE                       (*((volatile unsigned int*)(0x42A78930UL)))
#define bM4_PORT_PCRB2_LTE                        (*((volatile unsigned int*)(0x42A78938UL)))
#define bM4_PORT_PCRB2_DDIS                       (*((volatile unsigned int*)(0x42A7893CUL)))
#define bM4_PORT_PFSRB2_FSEL0                     (*((volatile unsigned int*)(0x42A78940UL)))
#define bM4_PORT_PFSRB2_FSEL1                     (*((volatile unsigned int*)(0x42A78944UL)))
#define bM4_PORT_PFSRB2_FSEL2                     (*((volatile unsigned int*)(0x42A78948UL)))
#define bM4_PORT_PFSRB2_FSEL3                     (*((volatile unsigned int*)(0x42A7894CUL)))
#define bM4_PORT_PFSRB2_FSEL4                     (*((volatile unsigned int*)(0x42A78950UL)))
#define bM4_PORT_PFSRB2_FSEL5                     (*((volatile unsigned int*)(0x42A78954UL)))
#define bM4_PORT_PFSRB2_BFE                       (*((volatile unsigned int*)(0x42A78960UL)))
#define bM4_PORT_PCRB3_POUT                       (*((volatile unsigned int*)(0x42A78980UL)))
#define bM4_PORT_PCRB3_POUTE                      (*((volatile unsigned int*)(0x42A78984UL)))
#define bM4_PORT_PCRB3_NOD                        (*((volatile unsigned int*)(0x42A78988UL)))
#define bM4_PORT_PCRB3_DRV0                       (*((volatile unsigned int*)(0x42A78990UL)))
#define bM4_PORT_PCRB3_DRV1                       (*((volatile unsigned int*)(0x42A78994UL)))
#define bM4_PORT_PCRB3_PUU                        (*((volatile unsigned int*)(0x42A78998UL)))
#define bM4_PORT_PCRB3_PIN                        (*((volatile unsigned int*)(0x42A789A0UL)))
#define bM4_PORT_PCRB3_INVE                       (*((volatile unsigned int*)(0x42A789A4UL)))
#define bM4_PORT_PCRB3_INTE                       (*((volatile unsigned int*)(0x42A789B0UL)))
#define bM4_PORT_PCRB3_LTE                        (*((volatile unsigned int*)(0x42A789B8UL)))
#define bM4_PORT_PCRB3_DDIS                       (*((volatile unsigned int*)(0x42A789BCUL)))
#define bM4_PORT_PFSRB3_FSEL0                     (*((volatile unsigned int*)(0x42A789C0UL)))
#define bM4_PORT_PFSRB3_FSEL1                     (*((volatile unsigned int*)(0x42A789C4UL)))
#define bM4_PORT_PFSRB3_FSEL2                     (*((volatile unsigned int*)(0x42A789C8UL)))
#define bM4_PORT_PFSRB3_FSEL3                     (*((volatile unsigned int*)(0x42A789CCUL)))
#define bM4_PORT_PFSRB3_FSEL4                     (*((volatile unsigned int*)(0x42A789D0UL)))
#define bM4_PORT_PFSRB3_FSEL5                     (*((volatile unsigned int*)(0x42A789D4UL)))
#define bM4_PORT_PFSRB3_BFE                       (*((volatile unsigned int*)(0x42A789E0UL)))
#define bM4_PORT_PCRB4_POUT                       (*((volatile unsigned int*)(0x42A78A00UL)))
#define bM4_PORT_PCRB4_POUTE                      (*((volatile unsigned int*)(0x42A78A04UL)))
#define bM4_PORT_PCRB4_NOD                        (*((volatile unsigned int*)(0x42A78A08UL)))
#define bM4_PORT_PCRB4_DRV0                       (*((volatile unsigned int*)(0x42A78A10UL)))
#define bM4_PORT_PCRB4_DRV1                       (*((volatile unsigned int*)(0x42A78A14UL)))
#define bM4_PORT_PCRB4_PUU                        (*((volatile unsigned int*)(0x42A78A18UL)))
#define bM4_PORT_PCRB4_PIN                        (*((volatile unsigned int*)(0x42A78A20UL)))
#define bM4_PORT_PCRB4_INVE                       (*((volatile unsigned int*)(0x42A78A24UL)))
#define bM4_PORT_PCRB4_INTE                       (*((volatile unsigned int*)(0x42A78A30UL)))
#define bM4_PORT_PCRB4_LTE                        (*((volatile unsigned int*)(0x42A78A38UL)))
#define bM4_PORT_PCRB4_DDIS                       (*((volatile unsigned int*)(0x42A78A3CUL)))
#define bM4_PORT_PFSRB4_FSEL0                     (*((volatile unsigned int*)(0x42A78A40UL)))
#define bM4_PORT_PFSRB4_FSEL1                     (*((volatile unsigned int*)(0x42A78A44UL)))
#define bM4_PORT_PFSRB4_FSEL2                     (*((volatile unsigned int*)(0x42A78A48UL)))
#define bM4_PORT_PFSRB4_FSEL3                     (*((volatile unsigned int*)(0x42A78A4CUL)))
#define bM4_PORT_PFSRB4_FSEL4                     (*((volatile unsigned int*)(0x42A78A50UL)))
#define bM4_PORT_PFSRB4_FSEL5                     (*((volatile unsigned int*)(0x42A78A54UL)))
#define bM4_PORT_PFSRB4_BFE                       (*((volatile unsigned int*)(0x42A78A60UL)))
#define bM4_PORT_PCRB5_POUT                       (*((volatile unsigned int*)(0x42A78A80UL)))
#define bM4_PORT_PCRB5_POUTE                      (*((volatile unsigned int*)(0x42A78A84UL)))
#define bM4_PORT_PCRB5_NOD                        (*((volatile unsigned int*)(0x42A78A88UL)))
#define bM4_PORT_PCRB5_DRV0                       (*((volatile unsigned int*)(0x42A78A90UL)))
#define bM4_PORT_PCRB5_DRV1                       (*((volatile unsigned int*)(0x42A78A94UL)))
#define bM4_PORT_PCRB5_PUU                        (*((volatile unsigned int*)(0x42A78A98UL)))
#define bM4_PORT_PCRB5_PIN                        (*((volatile unsigned int*)(0x42A78AA0UL)))
#define bM4_PORT_PCRB5_INVE                       (*((volatile unsigned int*)(0x42A78AA4UL)))
#define bM4_PORT_PCRB5_INTE                       (*((volatile unsigned int*)(0x42A78AB0UL)))
#define bM4_PORT_PCRB5_LTE                        (*((volatile unsigned int*)(0x42A78AB8UL)))
#define bM4_PORT_PCRB5_DDIS                       (*((volatile unsigned int*)(0x42A78ABCUL)))
#define bM4_PORT_PFSRB5_FSEL0                     (*((volatile unsigned int*)(0x42A78AC0UL)))
#define bM4_PORT_PFSRB5_FSEL1                     (*((volatile unsigned int*)(0x42A78AC4UL)))
#define bM4_PORT_PFSRB5_FSEL2                     (*((volatile unsigned int*)(0x42A78AC8UL)))
#define bM4_PORT_PFSRB5_FSEL3                     (*((volatile unsigned int*)(0x42A78ACCUL)))
#define bM4_PORT_PFSRB5_FSEL4                     (*((volatile unsigned int*)(0x42A78AD0UL)))
#define bM4_PORT_PFSRB5_FSEL5                     (*((volatile unsigned int*)(0x42A78AD4UL)))
#define bM4_PORT_PFSRB5_BFE                       (*((volatile unsigned int*)(0x42A78AE0UL)))
#define bM4_PORT_PCRB6_POUT                       (*((volatile unsigned int*)(0x42A78B00UL)))
#define bM4_PORT_PCRB6_POUTE                      (*((volatile unsigned int*)(0x42A78B04UL)))
#define bM4_PORT_PCRB6_NOD                        (*((volatile unsigned int*)(0x42A78B08UL)))
#define bM4_PORT_PCRB6_DRV0                       (*((volatile unsigned int*)(0x42A78B10UL)))
#define bM4_PORT_PCRB6_DRV1                       (*((volatile unsigned int*)(0x42A78B14UL)))
#define bM4_PORT_PCRB6_PUU                        (*((volatile unsigned int*)(0x42A78B18UL)))
#define bM4_PORT_PCRB6_PIN                        (*((volatile unsigned int*)(0x42A78B20UL)))
#define bM4_PORT_PCRB6_INVE                       (*((volatile unsigned int*)(0x42A78B24UL)))
#define bM4_PORT_PCRB6_INTE                       (*((volatile unsigned int*)(0x42A78B30UL)))
#define bM4_PORT_PCRB6_LTE                        (*((volatile unsigned int*)(0x42A78B38UL)))
#define bM4_PORT_PCRB6_DDIS                       (*((volatile unsigned int*)(0x42A78B3CUL)))
#define bM4_PORT_PFSRB6_FSEL0                     (*((volatile unsigned int*)(0x42A78B40UL)))
#define bM4_PORT_PFSRB6_FSEL1                     (*((volatile unsigned int*)(0x42A78B44UL)))
#define bM4_PORT_PFSRB6_FSEL2                     (*((volatile unsigned int*)(0x42A78B48UL)))
#define bM4_PORT_PFSRB6_FSEL3                     (*((volatile unsigned int*)(0x42A78B4CUL)))
#define bM4_PORT_PFSRB6_FSEL4                     (*((volatile unsigned int*)(0x42A78B50UL)))
#define bM4_PORT_PFSRB6_FSEL5                     (*((volatile unsigned int*)(0x42A78B54UL)))
#define bM4_PORT_PFSRB6_BFE                       (*((volatile unsigned int*)(0x42A78B60UL)))
#define bM4_PORT_PCRB7_POUT                       (*((volatile unsigned int*)(0x42A78B80UL)))
#define bM4_PORT_PCRB7_POUTE                      (*((volatile unsigned int*)(0x42A78B84UL)))
#define bM4_PORT_PCRB7_NOD                        (*((volatile unsigned int*)(0x42A78B88UL)))
#define bM4_PORT_PCRB7_DRV0                       (*((volatile unsigned int*)(0x42A78B90UL)))
#define bM4_PORT_PCRB7_DRV1                       (*((volatile unsigned int*)(0x42A78B94UL)))
#define bM4_PORT_PCRB7_PUU                        (*((volatile unsigned int*)(0x42A78B98UL)))
#define bM4_PORT_PCRB7_PIN                        (*((volatile unsigned int*)(0x42A78BA0UL)))
#define bM4_PORT_PCRB7_INVE                       (*((volatile unsigned int*)(0x42A78BA4UL)))
#define bM4_PORT_PCRB7_INTE                       (*((volatile unsigned int*)(0x42A78BB0UL)))
#define bM4_PORT_PCRB7_LTE                        (*((volatile unsigned int*)(0x42A78BB8UL)))
#define bM4_PORT_PCRB7_DDIS                       (*((volatile unsigned int*)(0x42A78BBCUL)))
#define bM4_PORT_PFSRB7_FSEL0                     (*((volatile unsigned int*)(0x42A78BC0UL)))
#define bM4_PORT_PFSRB7_FSEL1                     (*((volatile unsigned int*)(0x42A78BC4UL)))
#define bM4_PORT_PFSRB7_FSEL2                     (*((volatile unsigned int*)(0x42A78BC8UL)))
#define bM4_PORT_PFSRB7_FSEL3                     (*((volatile unsigned int*)(0x42A78BCCUL)))
#define bM4_PORT_PFSRB7_FSEL4                     (*((volatile unsigned int*)(0x42A78BD0UL)))
#define bM4_PORT_PFSRB7_FSEL5                     (*((volatile unsigned int*)(0x42A78BD4UL)))
#define bM4_PORT_PFSRB7_BFE                       (*((volatile unsigned int*)(0x42A78BE0UL)))
#define bM4_PORT_PCRB8_POUT                       (*((volatile unsigned int*)(0x42A78C00UL)))
#define bM4_PORT_PCRB8_POUTE                      (*((volatile unsigned int*)(0x42A78C04UL)))
#define bM4_PORT_PCRB8_NOD                        (*((volatile unsigned int*)(0x42A78C08UL)))
#define bM4_PORT_PCRB8_DRV0                       (*((volatile unsigned int*)(0x42A78C10UL)))
#define bM4_PORT_PCRB8_DRV1                       (*((volatile unsigned int*)(0x42A78C14UL)))
#define bM4_PORT_PCRB8_PUU                        (*((volatile unsigned int*)(0x42A78C18UL)))
#define bM4_PORT_PCRB8_PIN                        (*((volatile unsigned int*)(0x42A78C20UL)))
#define bM4_PORT_PCRB8_INVE                       (*((volatile unsigned int*)(0x42A78C24UL)))
#define bM4_PORT_PCRB8_INTE                       (*((volatile unsigned int*)(0x42A78C30UL)))
#define bM4_PORT_PCRB8_LTE                        (*((volatile unsigned int*)(0x42A78C38UL)))
#define bM4_PORT_PCRB8_DDIS                       (*((volatile unsigned int*)(0x42A78C3CUL)))
#define bM4_PORT_PFSRB8_FSEL0                     (*((volatile unsigned int*)(0x42A78C40UL)))
#define bM4_PORT_PFSRB8_FSEL1                     (*((volatile unsigned int*)(0x42A78C44UL)))
#define bM4_PORT_PFSRB8_FSEL2                     (*((volatile unsigned int*)(0x42A78C48UL)))
#define bM4_PORT_PFSRB8_FSEL3                     (*((volatile unsigned int*)(0x42A78C4CUL)))
#define bM4_PORT_PFSRB8_FSEL4                     (*((volatile unsigned int*)(0x42A78C50UL)))
#define bM4_PORT_PFSRB8_FSEL5                     (*((volatile unsigned int*)(0x42A78C54UL)))
#define bM4_PORT_PFSRB8_BFE                       (*((volatile unsigned int*)(0x42A78C60UL)))
#define bM4_PORT_PCRB9_POUT                       (*((volatile unsigned int*)(0x42A78C80UL)))
#define bM4_PORT_PCRB9_POUTE                      (*((volatile unsigned int*)(0x42A78C84UL)))
#define bM4_PORT_PCRB9_NOD                        (*((volatile unsigned int*)(0x42A78C88UL)))
#define bM4_PORT_PCRB9_DRV0                       (*((volatile unsigned int*)(0x42A78C90UL)))
#define bM4_PORT_PCRB9_DRV1                       (*((volatile unsigned int*)(0x42A78C94UL)))
#define bM4_PORT_PCRB9_PUU                        (*((volatile unsigned int*)(0x42A78C98UL)))
#define bM4_PORT_PCRB9_PIN                        (*((volatile unsigned int*)(0x42A78CA0UL)))
#define bM4_PORT_PCRB9_INVE                       (*((volatile unsigned int*)(0x42A78CA4UL)))
#define bM4_PORT_PCRB9_INTE                       (*((volatile unsigned int*)(0x42A78CB0UL)))
#define bM4_PORT_PCRB9_LTE                        (*((volatile unsigned int*)(0x42A78CB8UL)))
#define bM4_PORT_PCRB9_DDIS                       (*((volatile unsigned int*)(0x42A78CBCUL)))
#define bM4_PORT_PFSRB9_FSEL0                     (*((volatile unsigned int*)(0x42A78CC0UL)))
#define bM4_PORT_PFSRB9_FSEL1                     (*((volatile unsigned int*)(0x42A78CC4UL)))
#define bM4_PORT_PFSRB9_FSEL2                     (*((volatile unsigned int*)(0x42A78CC8UL)))
#define bM4_PORT_PFSRB9_FSEL3                     (*((volatile unsigned int*)(0x42A78CCCUL)))
#define bM4_PORT_PFSRB9_FSEL4                     (*((volatile unsigned int*)(0x42A78CD0UL)))
#define bM4_PORT_PFSRB9_FSEL5                     (*((volatile unsigned int*)(0x42A78CD4UL)))
#define bM4_PORT_PFSRB9_BFE                       (*((volatile unsigned int*)(0x42A78CE0UL)))
#define bM4_PORT_PCRB10_POUT                      (*((volatile unsigned int*)(0x42A78D00UL)))
#define bM4_PORT_PCRB10_POUTE                     (*((volatile unsigned int*)(0x42A78D04UL)))
#define bM4_PORT_PCRB10_NOD                       (*((volatile unsigned int*)(0x42A78D08UL)))
#define bM4_PORT_PCRB10_DRV0                      (*((volatile unsigned int*)(0x42A78D10UL)))
#define bM4_PORT_PCRB10_DRV1                      (*((volatile unsigned int*)(0x42A78D14UL)))
#define bM4_PORT_PCRB10_PUU                       (*((volatile unsigned int*)(0x42A78D18UL)))
#define bM4_PORT_PCRB10_PIN                       (*((volatile unsigned int*)(0x42A78D20UL)))
#define bM4_PORT_PCRB10_INVE                      (*((volatile unsigned int*)(0x42A78D24UL)))
#define bM4_PORT_PCRB10_INTE                      (*((volatile unsigned int*)(0x42A78D30UL)))
#define bM4_PORT_PCRB10_LTE                       (*((volatile unsigned int*)(0x42A78D38UL)))
#define bM4_PORT_PCRB10_DDIS                      (*((volatile unsigned int*)(0x42A78D3CUL)))
#define bM4_PORT_PFSRB10_FSEL0                    (*((volatile unsigned int*)(0x42A78D40UL)))
#define bM4_PORT_PFSRB10_FSEL1                    (*((volatile unsigned int*)(0x42A78D44UL)))
#define bM4_PORT_PFSRB10_FSEL2                    (*((volatile unsigned int*)(0x42A78D48UL)))
#define bM4_PORT_PFSRB10_FSEL3                    (*((volatile unsigned int*)(0x42A78D4CUL)))
#define bM4_PORT_PFSRB10_FSEL4                    (*((volatile unsigned int*)(0x42A78D50UL)))
#define bM4_PORT_PFSRB10_FSEL5                    (*((volatile unsigned int*)(0x42A78D54UL)))
#define bM4_PORT_PFSRB10_BFE                      (*((volatile unsigned int*)(0x42A78D60UL)))
#define bM4_PORT_PCRB11_POUT                      (*((volatile unsigned int*)(0x42A78D80UL)))
#define bM4_PORT_PCRB11_POUTE                     (*((volatile unsigned int*)(0x42A78D84UL)))
#define bM4_PORT_PCRB11_NOD                       (*((volatile unsigned int*)(0x42A78D88UL)))
#define bM4_PORT_PCRB11_DRV0                      (*((volatile unsigned int*)(0x42A78D90UL)))
#define bM4_PORT_PCRB11_DRV1                      (*((volatile unsigned int*)(0x42A78D94UL)))
#define bM4_PORT_PCRB11_PUU                       (*((volatile unsigned int*)(0x42A78D98UL)))
#define bM4_PORT_PCRB11_PIN                       (*((volatile unsigned int*)(0x42A78DA0UL)))
#define bM4_PORT_PCRB11_INVE                      (*((volatile unsigned int*)(0x42A78DA4UL)))
#define bM4_PORT_PCRB11_INTE                      (*((volatile unsigned int*)(0x42A78DB0UL)))
#define bM4_PORT_PCRB11_LTE                       (*((volatile unsigned int*)(0x42A78DB8UL)))
#define bM4_PORT_PCRB11_DDIS                      (*((volatile unsigned int*)(0x42A78DBCUL)))
#define bM4_PORT_PFSRB11_FSEL0                    (*((volatile unsigned int*)(0x42A78DC0UL)))
#define bM4_PORT_PFSRB11_FSEL1                    (*((volatile unsigned int*)(0x42A78DC4UL)))
#define bM4_PORT_PFSRB11_FSEL2                    (*((volatile unsigned int*)(0x42A78DC8UL)))
#define bM4_PORT_PFSRB11_FSEL3                    (*((volatile unsigned int*)(0x42A78DCCUL)))
#define bM4_PORT_PFSRB11_FSEL4                    (*((volatile unsigned int*)(0x42A78DD0UL)))
#define bM4_PORT_PFSRB11_FSEL5                    (*((volatile unsigned int*)(0x42A78DD4UL)))
#define bM4_PORT_PFSRB11_BFE                      (*((volatile unsigned int*)(0x42A78DE0UL)))
#define bM4_PORT_PCRB12_POUT                      (*((volatile unsigned int*)(0x42A78E00UL)))
#define bM4_PORT_PCRB12_POUTE                     (*((volatile unsigned int*)(0x42A78E04UL)))
#define bM4_PORT_PCRB12_NOD                       (*((volatile unsigned int*)(0x42A78E08UL)))
#define bM4_PORT_PCRB12_DRV0                      (*((volatile unsigned int*)(0x42A78E10UL)))
#define bM4_PORT_PCRB12_DRV1                      (*((volatile unsigned int*)(0x42A78E14UL)))
#define bM4_PORT_PCRB12_PUU                       (*((volatile unsigned int*)(0x42A78E18UL)))
#define bM4_PORT_PCRB12_PIN                       (*((volatile unsigned int*)(0x42A78E20UL)))
#define bM4_PORT_PCRB12_INVE                      (*((volatile unsigned int*)(0x42A78E24UL)))
#define bM4_PORT_PCRB12_INTE                      (*((volatile unsigned int*)(0x42A78E30UL)))
#define bM4_PORT_PCRB12_LTE                       (*((volatile unsigned int*)(0x42A78E38UL)))
#define bM4_PORT_PCRB12_DDIS                      (*((volatile unsigned int*)(0x42A78E3CUL)))
#define bM4_PORT_PFSRB12_FSEL0                    (*((volatile unsigned int*)(0x42A78E40UL)))
#define bM4_PORT_PFSRB12_FSEL1                    (*((volatile unsigned int*)(0x42A78E44UL)))
#define bM4_PORT_PFSRB12_FSEL2                    (*((volatile unsigned int*)(0x42A78E48UL)))
#define bM4_PORT_PFSRB12_FSEL3                    (*((volatile unsigned int*)(0x42A78E4CUL)))
#define bM4_PORT_PFSRB12_FSEL4                    (*((volatile unsigned int*)(0x42A78E50UL)))
#define bM4_PORT_PFSRB12_FSEL5                    (*((volatile unsigned int*)(0x42A78E54UL)))
#define bM4_PORT_PFSRB12_BFE                      (*((volatile unsigned int*)(0x42A78E60UL)))
#define bM4_PORT_PCRB13_POUT                      (*((volatile unsigned int*)(0x42A78E80UL)))
#define bM4_PORT_PCRB13_POUTE                     (*((volatile unsigned int*)(0x42A78E84UL)))
#define bM4_PORT_PCRB13_NOD                       (*((volatile unsigned int*)(0x42A78E88UL)))
