SoCXin/HC32F460/src/template_Rev1.0.5/hc32f460pctb_template/common/hc32f460pctb.h
#define bM4_PORT_PCRB13_DRV0                      (*((volatile unsigned int*)(0x42A78E90UL)))
#define bM4_PORT_PCRB13_DRV1                      (*((volatile unsigned int*)(0x42A78E94UL)))
#define bM4_PORT_PCRB13_PUU                       (*((volatile unsigned int*)(0x42A78E98UL)))
#define bM4_PORT_PCRB13_PIN                       (*((volatile unsigned int*)(0x42A78EA0UL)))
#define bM4_PORT_PCRB13_INVE                      (*((volatile unsigned int*)(0x42A78EA4UL)))
#define bM4_PORT_PCRB13_INTE                      (*((volatile unsigned int*)(0x42A78EB0UL)))
#define bM4_PORT_PCRB13_LTE                       (*((volatile unsigned int*)(0x42A78EB8UL)))
#define bM4_PORT_PCRB13_DDIS                      (*((volatile unsigned int*)(0x42A78EBCUL)))
#define bM4_PORT_PFSRB13_FSEL0                    (*((volatile unsigned int*)(0x42A78EC0UL)))
#define bM4_PORT_PFSRB13_FSEL1                    (*((volatile unsigned int*)(0x42A78EC4UL)))
#define bM4_PORT_PFSRB13_FSEL2                    (*((volatile unsigned int*)(0x42A78EC8UL)))
#define bM4_PORT_PFSRB13_FSEL3                    (*((volatile unsigned int*)(0x42A78ECCUL)))
#define bM4_PORT_PFSRB13_FSEL4                    (*((volatile unsigned int*)(0x42A78ED0UL)))
#define bM4_PORT_PFSRB13_FSEL5                    (*((volatile unsigned int*)(0x42A78ED4UL)))
#define bM4_PORT_PFSRB13_BFE                      (*((volatile unsigned int*)(0x42A78EE0UL)))
#define bM4_PORT_PCRB14_POUT                      (*((volatile unsigned int*)(0x42A78F00UL)))
#define bM4_PORT_PCRB14_POUTE                     (*((volatile unsigned int*)(0x42A78F04UL)))
#define bM4_PORT_PCRB14_NOD                       (*((volatile unsigned int*)(0x42A78F08UL)))
#define bM4_PORT_PCRB14_DRV0                      (*((volatile unsigned int*)(0x42A78F10UL)))
#define bM4_PORT_PCRB14_DRV1                      (*((volatile unsigned int*)(0x42A78F14UL)))
#define bM4_PORT_PCRB14_PUU                       (*((volatile unsigned int*)(0x42A78F18UL)))
#define bM4_PORT_PCRB14_PIN                       (*((volatile unsigned int*)(0x42A78F20UL)))
#define bM4_PORT_PCRB14_INVE                      (*((volatile unsigned int*)(0x42A78F24UL)))
#define bM4_PORT_PCRB14_INTE                      (*((volatile unsigned int*)(0x42A78F30UL)))
#define bM4_PORT_PCRB14_LTE                       (*((volatile unsigned int*)(0x42A78F38UL)))
#define bM4_PORT_PCRB14_DDIS                      (*((volatile unsigned int*)(0x42A78F3CUL)))
#define bM4_PORT_PFSRB14_FSEL0                    (*((volatile unsigned int*)(0x42A78F40UL)))
#define bM4_PORT_PFSRB14_FSEL1                    (*((volatile unsigned int*)(0x42A78F44UL)))
#define bM4_PORT_PFSRB14_FSEL2                    (*((volatile unsigned int*)(0x42A78F48UL)))
#define bM4_PORT_PFSRB14_FSEL3                    (*((volatile unsigned int*)(0x42A78F4CUL)))
#define bM4_PORT_PFSRB14_FSEL4                    (*((volatile unsigned int*)(0x42A78F50UL)))
#define bM4_PORT_PFSRB14_FSEL5                    (*((volatile unsigned int*)(0x42A78F54UL)))
#define bM4_PORT_PFSRB14_BFE                      (*((volatile unsigned int*)(0x42A78F60UL)))
#define bM4_PORT_PCRB15_POUT                      (*((volatile unsigned int*)(0x42A78F80UL)))
#define bM4_PORT_PCRB15_POUTE                     (*((volatile unsigned int*)(0x42A78F84UL)))
#define bM4_PORT_PCRB15_NOD                       (*((volatile unsigned int*)(0x42A78F88UL)))
#define bM4_PORT_PCRB15_DRV0                      (*((volatile unsigned int*)(0x42A78F90UL)))
#define bM4_PORT_PCRB15_DRV1                      (*((volatile unsigned int*)(0x42A78F94UL)))
#define bM4_PORT_PCRB15_PUU                       (*((volatile unsigned int*)(0x42A78F98UL)))
#define bM4_PORT_PCRB15_PIN                       (*((volatile unsigned int*)(0x42A78FA0UL)))
#define bM4_PORT_PCRB15_INVE                      (*((volatile unsigned int*)(0x42A78FA4UL)))
#define bM4_PORT_PCRB15_INTE                      (*((volatile unsigned int*)(0x42A78FB0UL)))
#define bM4_PORT_PCRB15_LTE                       (*((volatile unsigned int*)(0x42A78FB8UL)))
#define bM4_PORT_PCRB15_DDIS                      (*((volatile unsigned int*)(0x42A78FBCUL)))
#define bM4_PORT_PFSRB15_FSEL0                    (*((volatile unsigned int*)(0x42A78FC0UL)))
#define bM4_PORT_PFSRB15_FSEL1                    (*((volatile unsigned int*)(0x42A78FC4UL)))
#define bM4_PORT_PFSRB15_FSEL2                    (*((volatile unsigned int*)(0x42A78FC8UL)))
#define bM4_PORT_PFSRB15_FSEL3                    (*((volatile unsigned int*)(0x42A78FCCUL)))
#define bM4_PORT_PFSRB15_FSEL4                    (*((volatile unsigned int*)(0x42A78FD0UL)))
#define bM4_PORT_PFSRB15_FSEL5                    (*((volatile unsigned int*)(0x42A78FD4UL)))
#define bM4_PORT_PFSRB15_BFE                      (*((volatile unsigned int*)(0x42A78FE0UL)))
#define bM4_PORT_PCRC0_POUT                       (*((volatile unsigned int*)(0x42A79000UL)))
#define bM4_PORT_PCRC0_POUTE                      (*((volatile unsigned int*)(0x42A79004UL)))
#define bM4_PORT_PCRC0_NOD                        (*((volatile unsigned int*)(0x42A79008UL)))
#define bM4_PORT_PCRC0_DRV0                       (*((volatile unsigned int*)(0x42A79010UL)))
#define bM4_PORT_PCRC0_DRV1                       (*((volatile unsigned int*)(0x42A79014UL)))
#define bM4_PORT_PCRC0_PUU                        (*((volatile unsigned int*)(0x42A79018UL)))
#define bM4_PORT_PCRC0_PIN                        (*((volatile unsigned int*)(0x42A79020UL)))
#define bM4_PORT_PCRC0_INVE                       (*((volatile unsigned int*)(0x42A79024UL)))
#define bM4_PORT_PCRC0_INTE                       (*((volatile unsigned int*)(0x42A79030UL)))
#define bM4_PORT_PCRC0_LTE                        (*((volatile unsigned int*)(0x42A79038UL)))
#define bM4_PORT_PCRC0_DDIS                       (*((volatile unsigned int*)(0x42A7903CUL)))
#define bM4_PORT_PFSRC0_FSEL0                     (*((volatile unsigned int*)(0x42A79040UL)))
#define bM4_PORT_PFSRC0_FSEL1                     (*((volatile unsigned int*)(0x42A79044UL)))
#define bM4_PORT_PFSRC0_FSEL2                     (*((volatile unsigned int*)(0x42A79048UL)))
#define bM4_PORT_PFSRC0_FSEL3                     (*((volatile unsigned int*)(0x42A7904CUL)))
#define bM4_PORT_PFSRC0_FSEL4                     (*((volatile unsigned int*)(0x42A79050UL)))
#define bM4_PORT_PFSRC0_FSEL5                     (*((volatile unsigned int*)(0x42A79054UL)))
#define bM4_PORT_PFSRC0_BFE                       (*((volatile unsigned int*)(0x42A79060UL)))
#define bM4_PORT_PCRC1_POUT                       (*((volatile unsigned int*)(0x42A79080UL)))
#define bM4_PORT_PCRC1_POUTE                      (*((volatile unsigned int*)(0x42A79084UL)))
#define bM4_PORT_PCRC1_NOD                        (*((volatile unsigned int*)(0x42A79088UL)))
#define bM4_PORT_PCRC1_DRV0                       (*((volatile unsigned int*)(0x42A79090UL)))
#define bM4_PORT_PCRC1_DRV1                       (*((volatile unsigned int*)(0x42A79094UL)))
#define bM4_PORT_PCRC1_PUU                        (*((volatile unsigned int*)(0x42A79098UL)))
#define bM4_PORT_PCRC1_PIN                        (*((volatile unsigned int*)(0x42A790A0UL)))
#define bM4_PORT_PCRC1_INVE                       (*((volatile unsigned int*)(0x42A790A4UL)))
#define bM4_PORT_PCRC1_INTE                       (*((volatile unsigned int*)(0x42A790B0UL)))
#define bM4_PORT_PCRC1_LTE                        (*((volatile unsigned int*)(0x42A790B8UL)))
#define bM4_PORT_PCRC1_DDIS                       (*((volatile unsigned int*)(0x42A790BCUL)))
#define bM4_PORT_PFSRC1_FSEL0                     (*((volatile unsigned int*)(0x42A790C0UL)))
#define bM4_PORT_PFSRC1_FSEL1                     (*((volatile unsigned int*)(0x42A790C4UL)))
#define bM4_PORT_PFSRC1_FSEL2                     (*((volatile unsigned int*)(0x42A790C8UL)))
#define bM4_PORT_PFSRC1_FSEL3                     (*((volatile unsigned int*)(0x42A790CCUL)))
#define bM4_PORT_PFSRC1_FSEL4                     (*((volatile unsigned int*)(0x42A790D0UL)))
#define bM4_PORT_PFSRC1_FSEL5                     (*((volatile unsigned int*)(0x42A790D4UL)))
#define bM4_PORT_PFSRC1_BFE                       (*((volatile unsigned int*)(0x42A790E0UL)))
#define bM4_PORT_PCRC2_POUT                       (*((volatile unsigned int*)(0x42A79100UL)))
#define bM4_PORT_PCRC2_POUTE                      (*((volatile unsigned int*)(0x42A79104UL)))
#define bM4_PORT_PCRC2_NOD                        (*((volatile unsigned int*)(0x42A79108UL)))
#define bM4_PORT_PCRC2_DRV0                       (*((volatile unsigned int*)(0x42A79110UL)))
#define bM4_PORT_PCRC2_DRV1                       (*((volatile unsigned int*)(0x42A79114UL)))
#define bM4_PORT_PCRC2_PUU                        (*((volatile unsigned int*)(0x42A79118UL)))
#define bM4_PORT_PCRC2_PIN                        (*((volatile unsigned int*)(0x42A79120UL)))
#define bM4_PORT_PCRC2_INVE                       (*((volatile unsigned int*)(0x42A79124UL)))
#define bM4_PORT_PCRC2_INTE                       (*((volatile unsigned int*)(0x42A79130UL)))
#define bM4_PORT_PCRC2_LTE                        (*((volatile unsigned int*)(0x42A79138UL)))
#define bM4_PORT_PCRC2_DDIS                       (*((volatile unsigned int*)(0x42A7913CUL)))
#define bM4_PORT_PFSRC2_FSEL0                     (*((volatile unsigned int*)(0x42A79140UL)))
#define bM4_PORT_PFSRC2_FSEL1                     (*((volatile unsigned int*)(0x42A79144UL)))
#define bM4_PORT_PFSRC2_FSEL2                     (*((volatile unsigned int*)(0x42A79148UL)))
#define bM4_PORT_PFSRC2_FSEL3                     (*((volatile unsigned int*)(0x42A7914CUL)))
#define bM4_PORT_PFSRC2_FSEL4                     (*((volatile unsigned int*)(0x42A79150UL)))
#define bM4_PORT_PFSRC2_FSEL5                     (*((volatile unsigned int*)(0x42A79154UL)))
#define bM4_PORT_PFSRC2_BFE                       (*((volatile unsigned int*)(0x42A79160UL)))
#define bM4_PORT_PCRC3_POUT                       (*((volatile unsigned int*)(0x42A79180UL)))
#define bM4_PORT_PCRC3_POUTE                      (*((volatile unsigned int*)(0x42A79184UL)))
#define bM4_PORT_PCRC3_NOD                        (*((volatile unsigned int*)(0x42A79188UL)))
#define bM4_PORT_PCRC3_DRV0                       (*((volatile unsigned int*)(0x42A79190UL)))
#define bM4_PORT_PCRC3_DRV1                       (*((volatile unsigned int*)(0x42A79194UL)))
#define bM4_PORT_PCRC3_PUU                        (*((volatile unsigned int*)(0x42A79198UL)))
#define bM4_PORT_PCRC3_PIN                        (*((volatile unsigned int*)(0x42A791A0UL)))
#define bM4_PORT_PCRC3_INVE                       (*((volatile unsigned int*)(0x42A791A4UL)))
#define bM4_PORT_PCRC3_INTE                       (*((volatile unsigned int*)(0x42A791B0UL)))
#define bM4_PORT_PCRC3_LTE                        (*((volatile unsigned int*)(0x42A791B8UL)))
#define bM4_PORT_PCRC3_DDIS                       (*((volatile unsigned int*)(0x42A791BCUL)))
#define bM4_PORT_PFSRC3_FSEL0                     (*((volatile unsigned int*)(0x42A791C0UL)))
#define bM4_PORT_PFSRC3_FSEL1                     (*((volatile unsigned int*)(0x42A791C4UL)))
#define bM4_PORT_PFSRC3_FSEL2                     (*((volatile unsigned int*)(0x42A791C8UL)))
#define bM4_PORT_PFSRC3_FSEL3                     (*((volatile unsigned int*)(0x42A791CCUL)))
#define bM4_PORT_PFSRC3_FSEL4                     (*((volatile unsigned int*)(0x42A791D0UL)))
#define bM4_PORT_PFSRC3_FSEL5                     (*((volatile unsigned int*)(0x42A791D4UL)))
#define bM4_PORT_PFSRC3_BFE                       (*((volatile unsigned int*)(0x42A791E0UL)))
#define bM4_PORT_PCRC4_POUT                       (*((volatile unsigned int*)(0x42A79200UL)))
#define bM4_PORT_PCRC4_POUTE                      (*((volatile unsigned int*)(0x42A79204UL)))
#define bM4_PORT_PCRC4_NOD                        (*((volatile unsigned int*)(0x42A79208UL)))
#define bM4_PORT_PCRC4_DRV0                       (*((volatile unsigned int*)(0x42A79210UL)))
#define bM4_PORT_PCRC4_DRV1                       (*((volatile unsigned int*)(0x42A79214UL)))
#define bM4_PORT_PCRC4_PUU                        (*((volatile unsigned int*)(0x42A79218UL)))
#define bM4_PORT_PCRC4_PIN                        (*((volatile unsigned int*)(0x42A79220UL)))
#define bM4_PORT_PCRC4_INVE                       (*((volatile unsigned int*)(0x42A79224UL)))
#define bM4_PORT_PCRC4_INTE                       (*((volatile unsigned int*)(0x42A79230UL)))
#define bM4_PORT_PCRC4_LTE                        (*((volatile unsigned int*)(0x42A79238UL)))
#define bM4_PORT_PCRC4_DDIS                       (*((volatile unsigned int*)(0x42A7923CUL)))
#define bM4_PORT_PFSRC4_FSEL0                     (*((volatile unsigned int*)(0x42A79240UL)))
#define bM4_PORT_PFSRC4_FSEL1                     (*((volatile unsigned int*)(0x42A79244UL)))
#define bM4_PORT_PFSRC4_FSEL2                     (*((volatile unsigned int*)(0x42A79248UL)))
#define bM4_PORT_PFSRC4_FSEL3                     (*((volatile unsigned int*)(0x42A7924CUL)))
#define bM4_PORT_PFSRC4_FSEL4                     (*((volatile unsigned int*)(0x42A79250UL)))
#define bM4_PORT_PFSRC4_FSEL5                     (*((volatile unsigned int*)(0x42A79254UL)))
#define bM4_PORT_PFSRC4_BFE                       (*((volatile unsigned int*)(0x42A79260UL)))
#define bM4_PORT_PCRC5_POUT                       (*((volatile unsigned int*)(0x42A79280UL)))
#define bM4_PORT_PCRC5_POUTE                      (*((volatile unsigned int*)(0x42A79284UL)))
#define bM4_PORT_PCRC5_NOD                        (*((volatile unsigned int*)(0x42A79288UL)))
#define bM4_PORT_PCRC5_DRV0                       (*((volatile unsigned int*)(0x42A79290UL)))
#define bM4_PORT_PCRC5_DRV1                       (*((volatile unsigned int*)(0x42A79294UL)))
#define bM4_PORT_PCRC5_PUU                        (*((volatile unsigned int*)(0x42A79298UL)))
#define bM4_PORT_PCRC5_PIN                        (*((volatile unsigned int*)(0x42A792A0UL)))
#define bM4_PORT_PCRC5_INVE                       (*((volatile unsigned int*)(0x42A792A4UL)))
#define bM4_PORT_PCRC5_INTE                       (*((volatile unsigned int*)(0x42A792B0UL)))
#define bM4_PORT_PCRC5_LTE                        (*((volatile unsigned int*)(0x42A792B8UL)))
#define bM4_PORT_PCRC5_DDIS                       (*((volatile unsigned int*)(0x42A792BCUL)))
#define bM4_PORT_PFSRC5_FSEL0                     (*((volatile unsigned int*)(0x42A792C0UL)))
#define bM4_PORT_PFSRC5_FSEL1                     (*((volatile unsigned int*)(0x42A792C4UL)))
#define bM4_PORT_PFSRC5_FSEL2                     (*((volatile unsigned int*)(0x42A792C8UL)))
#define bM4_PORT_PFSRC5_FSEL3                     (*((volatile unsigned int*)(0x42A792CCUL)))
#define bM4_PORT_PFSRC5_FSEL4                     (*((volatile unsigned int*)(0x42A792D0UL)))
#define bM4_PORT_PFSRC5_FSEL5                     (*((volatile unsigned int*)(0x42A792D4UL)))
#define bM4_PORT_PFSRC5_BFE                       (*((volatile unsigned int*)(0x42A792E0UL)))
#define bM4_PORT_PCRC6_POUT                       (*((volatile unsigned int*)(0x42A79300UL)))
#define bM4_PORT_PCRC6_POUTE                      (*((volatile unsigned int*)(0x42A79304UL)))
#define bM4_PORT_PCRC6_NOD                        (*((volatile unsigned int*)(0x42A79308UL)))
#define bM4_PORT_PCRC6_DRV0                       (*((volatile unsigned int*)(0x42A79310UL)))
#define bM4_PORT_PCRC6_DRV1                       (*((volatile unsigned int*)(0x42A79314UL)))
#define bM4_PORT_PCRC6_PUU                        (*((volatile unsigned int*)(0x42A79318UL)))
#define bM4_PORT_PCRC6_PIN                        (*((volatile unsigned int*)(0x42A79320UL)))
#define bM4_PORT_PCRC6_INVE                       (*((volatile unsigned int*)(0x42A79324UL)))
#define bM4_PORT_PCRC6_INTE                       (*((volatile unsigned int*)(0x42A79330UL)))
#define bM4_PORT_PCRC6_LTE                        (*((volatile unsigned int*)(0x42A79338UL)))
#define bM4_PORT_PCRC6_DDIS                       (*((volatile unsigned int*)(0x42A7933CUL)))
#define bM4_PORT_PFSRC6_FSEL0                     (*((volatile unsigned int*)(0x42A79340UL)))
#define bM4_PORT_PFSRC6_FSEL1                     (*((volatile unsigned int*)(0x42A79344UL)))
#define bM4_PORT_PFSRC6_FSEL2                     (*((volatile unsigned int*)(0x42A79348UL)))
#define bM4_PORT_PFSRC6_FSEL3                     (*((volatile unsigned int*)(0x42A7934CUL)))
#define bM4_PORT_PFSRC6_FSEL4                     (*((volatile unsigned int*)(0x42A79350UL)))
#define bM4_PORT_PFSRC6_FSEL5                     (*((volatile unsigned int*)(0x42A79354UL)))
#define bM4_PORT_PFSRC6_BFE                       (*((volatile unsigned int*)(0x42A79360UL)))
#define bM4_PORT_PCRC7_POUT                       (*((volatile unsigned int*)(0x42A79380UL)))
#define bM4_PORT_PCRC7_POUTE                      (*((volatile unsigned int*)(0x42A79384UL)))
#define bM4_PORT_PCRC7_NOD                        (*((volatile unsigned int*)(0x42A79388UL)))
#define bM4_PORT_PCRC7_DRV0                       (*((volatile unsigned int*)(0x42A79390UL)))
#define bM4_PORT_PCRC7_DRV1                       (*((volatile unsigned int*)(0x42A79394UL)))
#define bM4_PORT_PCRC7_PUU                        (*((volatile unsigned int*)(0x42A79398UL)))
#define bM4_PORT_PCRC7_PIN                        (*((volatile unsigned int*)(0x42A793A0UL)))
#define bM4_PORT_PCRC7_INVE                       (*((volatile unsigned int*)(0x42A793A4UL)))
#define bM4_PORT_PCRC7_INTE                       (*((volatile unsigned int*)(0x42A793B0UL)))
#define bM4_PORT_PCRC7_LTE                        (*((volatile unsigned int*)(0x42A793B8UL)))
#define bM4_PORT_PCRC7_DDIS                       (*((volatile unsigned int*)(0x42A793BCUL)))
#define bM4_PORT_PFSRC7_FSEL0                     (*((volatile unsigned int*)(0x42A793C0UL)))
#define bM4_PORT_PFSRC7_FSEL1                     (*((volatile unsigned int*)(0x42A793C4UL)))
#define bM4_PORT_PFSRC7_FSEL2                     (*((volatile unsigned int*)(0x42A793C8UL)))
#define bM4_PORT_PFSRC7_FSEL3                     (*((volatile unsigned int*)(0x42A793CCUL)))
#define bM4_PORT_PFSRC7_FSEL4                     (*((volatile unsigned int*)(0x42A793D0UL)))
#define bM4_PORT_PFSRC7_FSEL5                     (*((volatile unsigned int*)(0x42A793D4UL)))
#define bM4_PORT_PFSRC7_BFE                       (*((volatile unsigned int*)(0x42A793E0UL)))
#define bM4_PORT_PCRC8_POUT                       (*((volatile unsigned int*)(0x42A79400UL)))
#define bM4_PORT_PCRC8_POUTE                      (*((volatile unsigned int*)(0x42A79404UL)))
#define bM4_PORT_PCRC8_NOD                        (*((volatile unsigned int*)(0x42A79408UL)))
#define bM4_PORT_PCRC8_DRV0                       (*((volatile unsigned int*)(0x42A79410UL)))
#define bM4_PORT_PCRC8_DRV1                       (*((volatile unsigned int*)(0x42A79414UL)))
#define bM4_PORT_PCRC8_PUU                        (*((volatile unsigned int*)(0x42A79418UL)))
#define bM4_PORT_PCRC8_PIN                        (*((volatile unsigned int*)(0x42A79420UL)))
#define bM4_PORT_PCRC8_INVE                       (*((volatile unsigned int*)(0x42A79424UL)))
#define bM4_PORT_PCRC8_INTE                       (*((volatile unsigned int*)(0x42A79430UL)))
#define bM4_PORT_PCRC8_LTE                        (*((volatile unsigned int*)(0x42A79438UL)))
#define bM4_PORT_PCRC8_DDIS                       (*((volatile unsigned int*)(0x42A7943CUL)))
#define bM4_PORT_PFSRC8_FSEL0                     (*((volatile unsigned int*)(0x42A79440UL)))
#define bM4_PORT_PFSRC8_FSEL1                     (*((volatile unsigned int*)(0x42A79444UL)))
#define bM4_PORT_PFSRC8_FSEL2                     (*((volatile unsigned int*)(0x42A79448UL)))
#define bM4_PORT_PFSRC8_FSEL3                     (*((volatile unsigned int*)(0x42A7944CUL)))
#define bM4_PORT_PFSRC8_FSEL4                     (*((volatile unsigned int*)(0x42A79450UL)))
#define bM4_PORT_PFSRC8_FSEL5                     (*((volatile unsigned int*)(0x42A79454UL)))
#define bM4_PORT_PFSRC8_BFE                       (*((volatile unsigned int*)(0x42A79460UL)))
#define bM4_PORT_PCRC9_POUT                       (*((volatile unsigned int*)(0x42A79480UL)))
#define bM4_PORT_PCRC9_POUTE                      (*((volatile unsigned int*)(0x42A79484UL)))
#define bM4_PORT_PCRC9_NOD                        (*((volatile unsigned int*)(0x42A79488UL)))
#define bM4_PORT_PCRC9_DRV0                       (*((volatile unsigned int*)(0x42A79490UL)))
#define bM4_PORT_PCRC9_DRV1                       (*((volatile unsigned int*)(0x42A79494UL)))
#define bM4_PORT_PCRC9_PUU                        (*((volatile unsigned int*)(0x42A79498UL)))
#define bM4_PORT_PCRC9_PIN                        (*((volatile unsigned int*)(0x42A794A0UL)))
#define bM4_PORT_PCRC9_INVE                       (*((volatile unsigned int*)(0x42A794A4UL)))
#define bM4_PORT_PCRC9_INTE                       (*((volatile unsigned int*)(0x42A794B0UL)))
#define bM4_PORT_PCRC9_LTE                        (*((volatile unsigned int*)(0x42A794B8UL)))
#define bM4_PORT_PCRC9_DDIS                       (*((volatile unsigned int*)(0x42A794BCUL)))
#define bM4_PORT_PFSRC9_FSEL0                     (*((volatile unsigned int*)(0x42A794C0UL)))
#define bM4_PORT_PFSRC9_FSEL1                     (*((volatile unsigned int*)(0x42A794C4UL)))
#define bM4_PORT_PFSRC9_FSEL2                     (*((volatile unsigned int*)(0x42A794C8UL)))
#define bM4_PORT_PFSRC9_FSEL3                     (*((volatile unsigned int*)(0x42A794CCUL)))
#define bM4_PORT_PFSRC9_FSEL4                     (*((volatile unsigned int*)(0x42A794D0UL)))
#define bM4_PORT_PFSRC9_FSEL5                     (*((volatile unsigned int*)(0x42A794D4UL)))
#define bM4_PORT_PFSRC9_BFE                       (*((volatile unsigned int*)(0x42A794E0UL)))
#define bM4_PORT_PCRC10_POUT                      (*((volatile unsigned int*)(0x42A79500UL)))
#define bM4_PORT_PCRC10_POUTE                     (*((volatile unsigned int*)(0x42A79504UL)))
#define bM4_PORT_PCRC10_NOD                       (*((volatile unsigned int*)(0x42A79508UL)))
#define bM4_PORT_PCRC10_DRV0                      (*((volatile unsigned int*)(0x42A79510UL)))
#define bM4_PORT_PCRC10_DRV1                      (*((volatile unsigned int*)(0x42A79514UL)))
#define bM4_PORT_PCRC10_PUU                       (*((volatile unsigned int*)(0x42A79518UL)))
#define bM4_PORT_PCRC10_PIN                       (*((volatile unsigned int*)(0x42A79520UL)))
#define bM4_PORT_PCRC10_INVE                      (*((volatile unsigned int*)(0x42A79524UL)))
#define bM4_PORT_PCRC10_INTE                      (*((volatile unsigned int*)(0x42A79530UL)))
#define bM4_PORT_PCRC10_LTE                       (*((volatile unsigned int*)(0x42A79538UL)))
#define bM4_PORT_PCRC10_DDIS                      (*((volatile unsigned int*)(0x42A7953CUL)))
#define bM4_PORT_PFSRC10_FSEL0                    (*((volatile unsigned int*)(0x42A79540UL)))
#define bM4_PORT_PFSRC10_FSEL1                    (*((volatile unsigned int*)(0x42A79544UL)))
#define bM4_PORT_PFSRC10_FSEL2                    (*((volatile unsigned int*)(0x42A79548UL)))
#define bM4_PORT_PFSRC10_FSEL3                    (*((volatile unsigned int*)(0x42A7954CUL)))
#define bM4_PORT_PFSRC10_FSEL4                    (*((volatile unsigned int*)(0x42A79550UL)))
#define bM4_PORT_PFSRC10_FSEL5                    (*((volatile unsigned int*)(0x42A79554UL)))
#define bM4_PORT_PFSRC10_BFE                      (*((volatile unsigned int*)(0x42A79560UL)))
#define bM4_PORT_PCRC11_POUT                      (*((volatile unsigned int*)(0x42A79580UL)))
#define bM4_PORT_PCRC11_POUTE                     (*((volatile unsigned int*)(0x42A79584UL)))
#define bM4_PORT_PCRC11_NOD                       (*((volatile unsigned int*)(0x42A79588UL)))
#define bM4_PORT_PCRC11_DRV0                      (*((volatile unsigned int*)(0x42A79590UL)))
#define bM4_PORT_PCRC11_DRV1                      (*((volatile unsigned int*)(0x42A79594UL)))
#define bM4_PORT_PCRC11_PUU                       (*((volatile unsigned int*)(0x42A79598UL)))
